
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформлениеФормы();
	
	УзелОбменаЭтаИБ = ПроверитьУзелОбменаЭтаИБСервер();
	
	Если УзелОбменаЭтаИБ Тогда
		Возврат;
	КонецЕсли;
	
	РазделениеВключено = Ложь;
	
	ВыполнитьДействияПриСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Задание = ТекущийОбъект.СуществующееЗадание();
	
	Если Не Задание = Неопределено Тогда
		
		Если ТипЗнч(Задание.Расписание) = Тип("РасписаниеРегламентногоЗадания") Тогда
			РасписаниеРегламентногоЗаданияОбмена = Задание.Расписание;
		ИначеЕсли ТипЗнч(Задание.Расписание) = Тип("ХранилищеЗначения") Тогда
			РасписаниеРегламентногоЗаданияОбмена = Задание.Расписание.Получить();
		Иначе
			РасписаниеРегламентногоЗаданияОбмена = Неопределено;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Обмен с сайтом по расписанию
	Если ТекущийОбъект.ИспользоватьРегламентноеЗадание
		И (РасписаниеРегламентногоЗаданияОбмена = Неопределено
		ИЛИ (РазделениеВключено И Не РасписаниеРегламентногоЗаданияОбмена.ПериодПовтораВТечениеДня > 0)) Тогда
		
		ТекущийОбъект.ИспользоватьРегламентноеЗадание = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);	
	ТекущийОбъект.ВключитьОтключитьРегламентноеЗадание(РасписаниеРегламентногоЗаданияОбмена);	
	УстановитьПривилегированныйРежим(Ложь);
	
	// Сохранение видов цен.
	ВидыЦен = ТекущийОбъект.ВидыЦен;
	ВидыЦен.Очистить();
	
	Для каждого ЭлементСЗ Из СписокВидовЦен Цикл 
		
		НоваяСтрока = ВидыЦен.Добавить();
		НоваяСтрока.ВидЦен = ЭлементСЗ.Значение;
		
	КонецЦикла;
	
	// Таблицы каталогов и услуг.
	ТаблицаКаталоговСохранить(ТекущийОбъект);
	
	ТекущийОбъект.ВыполнятьПолнуюВыгрузкуПринудительно = ТекущийОбъект.ЭтоНовый();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если УзелОбменаЭтаИБ Тогда
		
		ОчиститьСообщения();
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Узел соответствует этой информационной базе и не может использоваться в обмене с сайтом. Используйте другой узел обмена или создайте новый.'"));
			
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
	Элементы.НастроитьРасписаниеОбмена.Заголовок = УстановитьНадписьРасписания(РасписаниеРегламентногоЗаданияОбмена, "ИнтервалОбменаССайтом");

	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ОбменТоварами И ТаблицаКаталогов.Количество() = 0 Тогда
		
		Отказ = Истина;
		
		Сообщение = НСтр("ru = 'Таблица каталогов не заполнена!'");
		Поле = "ТаблицаКаталогов";
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение, Объект.Ссылка, Поле);
		
	КонецЕсли;
	
	Если Объект.ОбменТоварами И СписокВидовЦен.Количество() = 0 Тогда
		
		Отказ = Истина;
		
		Сообщение = НСтр("ru = 'Вид цен для товаров не выбран!'");
		Поле = "ВыбратьВидыЦенНоменклатуры";
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, Объект.Ссылка, Поле);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбщегоНазначения

&НаСервере
Процедура ВыполнитьДействияПриСозданииНаСервере()
	
	//++ №12317
	Если НЕ ПараметрыСеанса.ЭтоОблако Тогда
	// ПолучитьФункциональнуюОпцию("РаботаВЛокальномРежиме") Тогда
	//-- №12317
		Элементы.ГруппаВыгружатьНаСайтГоризонтально.Видимость = Истина;
	Иначе
		Элементы.ГруппаВыгружатьНаСайтГоризонтально.Видимость = Ложь;
		Если Не Объект.ВыгружатьНаСайт Тогда
			Объект.ВыгружатьНаСайт = Истина;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.ДатаНачалаВыгрузкиЗаказов = НачалоМесяца(ТекущаяДата());
		Объект.СтатусЗаказа = ПолучитьСтатусЗаказаПокупателя();
	КонецЕсли;
		
	ЗаполнитьГиперссылкиЦенСервер();
	
	ЗаполнитьТаблицуКаталоговСервер();
	
	УстановитьПараметрыТаблицыКаталоговСервер();
	
	УстановитьТипЗначенийСпискаГруппТаблицыКаталоговСервер();
	
	Если ЗначениеЗаполнено(Объект.НастройкиПоискаКонтрагентов) Тогда
		НастройкиПоискаКонтрагентовПредставление = ПоискКонтрагентовПредставление(ОбщийМодульВызовСервера.ЧтениеJSONВСтруктуру(Объект.НастройкиПоискаКонтрагентов));
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИДоступностьЭлементов()
	
	Элементы.СтраницаВыгрузкаТоваров.Видимость = Объект.ОбменТоварами;
	Элементы.СтраницаОбменЗаказами.Видимость = Объект.ОбменЗаказами;
	
	УстановитьДоступностьПолейОбменЗаказами();	
	
	Если Не РазделениеВключено Тогда
		Элементы.ГруппаАвтообменСтраницы.ТекущаяСтраница = Элементы.ГруппаАвтообменСтраница1;
		Элементы.НастроитьРасписаниеОбмена.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	Иначе
		Элементы.ГруппаАвтообменСтраницы.ТекущаяСтраница = Элементы.ГруппаАвтообменСтраница2;
		Элементы.ИнтервалОбменаССайтом.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	КонецЕсли;
	
	Если Объект.СпособИдентификацииКонтрагентов = ПредопределенноеЗначение("Перечисление.СпособыИдентификацииКонтрагентов.ПредопределенноеЗначение") Тогда
		Элементы.КонтрагентДляПодстановкиВЗаказы.Видимость = Истина;
		Элементы.ГруппаДляНовыхКонтрагентов.Доступность = Ложь;
	Иначе
		Элементы.КонтрагентДляПодстановкиВЗаказы.Видимость = Ложь;
		Элементы.ГруппаДляНовыхКонтрагентов.Доступность = Истина;
	КонецЕсли;
	
	Если Объект.ВыгружатьНаСайт Тогда
		Элементы.СтраницыТипОбмена.ТекущаяСтраница = Элементы.СтраницаВыгрузкаНаСайт;
		ПереключательНазначениеОбмена = 0;
	Иначе
		Элементы.СтраницыТипОбмена.ТекущаяСтраница = Элементы.СтраницаВыгрузкаВКаталог;
		ПереключательНазначениеОбмена = 1;
	КонецЕсли;	
	
	Элементы.ВыгружатьОстаткиПоСкладам.Видимость = Истина;
		
	Если Объект.РежимВыгрузкиЦен=1 Тогда
		Элементы.ГруппаНастройки.Доступность = Ложь;
	Иначе
		Элементы.ГруппаНастройки.Доступность = Истина;
	КонецЕсли;
	
	Если Объект.ВыгружатьИзменения Тогда
		ЭтотОбъект.ПереключательВыгрузкаИзменений = 1;
	Иначе
		ЭтотОбъект.ПереключательВыгрузкаИзменений = 0;
	КонецЕсли;
	// №12317 Элементы.ГруппаВыгружатьИзменения.Доступность = Объект.ИспользоватьРегламентноеЗадание;
		
	УстановитьВидимостьСтраницФормы();
	
	ВидимостьСпособИдентификацииКонтрагентов();
	
	//++ №13563 логирование теперь общее
	////++ №8430
	//Элементы.ОбрезатьИсториюОбменов.Доступность = Объект.ВестиЛогированиеОбмена;
	//Элементы.ЧислоДнейХраненияИстории.Доступность = Объект.ВестиЛогированиеОбмена И Объект.ОбрезатьИсториюОбменов;
	////-- №8430
	//Элементы.ЛогСобытийОтключитьПосле.Доступность = Объект.ВестиЛогированиеОбмена;
	//-- №13563 логирование теперь общее
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГиперссылкиЦенСервер()
	
	СписокВидовЦенСтрока = "";
	Для каждого СтрокаВидовЦен Из Объект.ВидыЦен Цикл 
		
		НовыйЭлемент = СписокВидовЦен.Добавить();
		НовыйЭлемент.Значение = СтрокаВидовЦен.ВидЦен;
		
		СписокВидовЦенСтрока = СписокВидовЦенСтрока + ?(СписокВидовЦенСтрока = "","","; ") + СтрокаВидовЦен.ВидЦен.Наименование;
		
	КонецЦикла;
	Элементы.ВыбратьВидыЦенНоменклатуры.Заголовок = "Вид цен: "+СписокВидовЦенСтрока;
		
КонецПроцедуры

&НаСервере
Функция ПроверитьУзелОбменаЭтаИБСервер()
	
	ЭтотУзел = ПланыОбмена.ОбменССайтом.ЭтотУзел();
	Возврат Объект.Ссылка = ЭтотУзел;
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьПолейОбменЗаказами()
	
	Элементы.ФайлЗагрузки.Доступность = Объект.ОбменЗаказами;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииОбменЗаказами()
	
	УстановитьВидимостьСтраницФормы();
	УстановитьДоступностьПолейОбменЗаказами();
	
	Если НЕ ЗначениеЗаполнено(Объект.ФайлЗагрузки) И ЗначениеЗаполнено(Объект.КаталогВыгрузки) И ПереключательНазначениеОбмена=1 И Объект.ОбменЗаказами Тогда
		Объект.ФайлЗагрузки = Объект.КаталогВыгрузки + "\Orders.xml";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСпособИдентификацииКонтрагентов()
	
	ВидимостьСпособИдентификацииКонтрагентов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьСпособИдентификацииКонтрагентов()
	
	СпособПредопределенноеЗначение = (Объект.СпособИдентификацииКонтрагентов = ПредопределенноеЗначение("Перечисление.СпособыИдентификацииКонтрагентов.ПредопределенноеЗначение"));
	
	Если Объект.НастройкиПоискаКонтрагентов = "" Тогда
		Объект.НастройкиПоискаКонтрагентов = ОбщийМодульВызовСервера.ЗаписьJSONВСтруктуру(ОбменССайтомCML.ПоляПоискаКонтрагентовПоУмолчанию(Истина));
		НастройкиПоискаКонтрагентовПредставление = ПоискКонтрагентовПредставление(ОбщийМодульВызовСервера.ЧтениеJSONВСтруктуру(Объект.НастройкиПоискаКонтрагентов));
	КонецЕсли;
	
	Элементы.КонтрагентДляПодстановкиВЗаказы.Видимость = СпособПредопределенноеЗначение;
	Элементы.ГруппаДляНовыхКонтрагентов.Видимость = НЕ СпособПредопределенноеЗначение;
	Элементы.НастройкиПоискаКонтрагентов.Видимость = НЕ СпособПредопределенноеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПереключательНазначениеОбмена()
	
	Объект.ВыгружатьНаСайт = ПереключательНазначениеОбмена = 0;
	УстановитьВидимостьСтраницТипаОбмена();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Функция возвращает ПериодПовтораВТечениеДня в секундах
Функция ПолучитьПериодПовтораВТечениеДня()
	
	ЗначенияВыбора = СоответствиеЗначенийВыбораККоличествуСекунд();
	
	ПериодПовтораВТечениеДня = ЗначенияВыбора.Получить(ИнтервалОбменаССайтом);
	Возврат ?(ПериодПовтораВТечениеДня = Неопределено, 1800, ПериодПовтораВТечениеДня);
	
КонецФункции //ПолучитьПериодПовтораВТечениеДня()

&НаКлиенте
Функция СоответствиеЗначенийВыбораККоличествуСекунд()
	
	СоответствиеНадписей = Новый Соответствие;
	СоответствиеНадписей.Вставить("Один раз в 5 минут", 300);
	СоответствиеНадписей.Вставить("Один раз в 15 минут", 900);
	СоответствиеНадписей.Вставить("Один раз в 30 минут", 1800);
	СоответствиеНадписей.Вставить("Один раз в час", 3600);
	СоответствиеНадписей.Вставить("Один раз в 3 часа", 10800);
	СоответствиеНадписей.Вставить("Один раз в 6 часов", 21600);
	СоответствиеНадписей.Вставить("Один раз в 12 часов", 43200);
	
	Возврат СоответствиеНадписей;
	
КонецФункции //СоответствиеЗначенийВыбораККоличествуСекунд()


// Заполняет значения расписания регламентного задания.
&НаКлиенте
Процедура УстановитьРасписаниеРегламентногоЗаданияОбмена()
	
	Месяцы = Новый Массив;
	Месяцы.Добавить(1);
	Месяцы.Добавить(2);
	Месяцы.Добавить(3);
	Месяцы.Добавить(4);
	Месяцы.Добавить(5);
	Месяцы.Добавить(6);
	Месяцы.Добавить(7);
	Месяцы.Добавить(8);
	Месяцы.Добавить(9);
	Месяцы.Добавить(10);
	Месяцы.Добавить(11);
	Месяцы.Добавить(12);

	ДниНедели = Новый Массив;
	ДниНедели.Добавить(1);
	ДниНедели.Добавить(2);
	ДниНедели.Добавить(3);
	ДниНедели.Добавить(4);
	ДниНедели.Добавить(5);
	ДниНедели.Добавить(6);
	ДниНедели.Добавить(7);
	
	ПериодПовтораВТечениеДня = ПолучитьПериодПовтораВТечениеДня();
	
	Если ПериодПовтораВТечениеДня > 0 Тогда
		
		Расписание = Новый РасписаниеРегламентногоЗадания;
		Расписание.Месяцы					= Месяцы;
		Расписание.ДниНедели				= ДниНедели;
		Расписание.ПериодПовтораВТечениеДня = ПериодПовтораВТечениеДня; // секунды
		Расписание.ПериодПовтораДней		= 1; // каждый день
		
		РасписаниеРегламентногоЗаданияОбмена = Расписание;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьНадписьРасписания(Расписание, СтрокаРасписания)
	
	Если Не РазделениеВключено Тогда
		
		Если Расписание = Неопределено Тогда
			ТекстЗаголовка = НСтр("ru='Настроить расписание обмена'");
		Иначе
			ТекстЗаголовка = Расписание;
		КонецЕсли;
		
		Возврат ТекстЗаголовка;
		
	Иначе
		
		Если Расписание = Неопределено Тогда
			
			Если СтрокаРасписания = "ИнтервалЗагрузкиОплатССайта" Тогда
			    ЭтотОбъект[СтрокаРасписания] = "Один раз в 5 минут"; 
			Иначе	
				ЭтотОбъект[СтрокаРасписания] = "Один раз в 30 минут"; 
			КонецЕсли;
			
		Иначе
			
			ЗначениеПериода = Расписание.ПериодПовтораВТечениеДня;
			Если ЗначениеПериода = 0 Тогда
				
				ЭтотОбъект[СтрокаРасписания] = "Один раз в 30 минут";
				
			ИначеЕсли ЗначениеПериода <= 300 Тогда
				
				ЭтотОбъект[СтрокаРасписания] = "Один раз в 5 минут";
				
			ИначеЕсли ЗначениеПериода <= 900 Тогда
				
				ЭтотОбъект[СтрокаРасписания] = "Один раз в 15 минут";
				
			ИначеЕсли ЗначениеПериода <= 1800 Тогда
				
				ЭтотОбъект[СтрокаРасписания] = "Один раз в 30 минут";
				
			ИначеЕсли ЗначениеПериода <= 3600 Тогда
				
				ЭтотОбъект[СтрокаРасписания] = "Один раз в час";
				
			ИначеЕсли ЗначениеПериода <= 10800 Тогда
				
				ЭтотОбъект[СтрокаРасписания] = "Один раз в 3 часа";
				
			ИначеЕсли ЗначениеПериода <= 21600 Тогда
				
				ЭтотОбъект[СтрокаРасписания] = "Один раз в 6 часов";
				
			ИначеЕсли ЗначениеПериода <= 43200 Тогда
				
				ЭтотОбъект[СтрокаРасписания] = "Один раз в 12 часов";
				
			КонецЕсли;
			
			Возврат ЭтотОбъект[СтрокаРасписания];
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПриИзмененииИспользоватьРегламентныеЗадания()
	
	УстановитьДоступностьРасписанияОбмена();
	
	Если Объект.ИспользоватьРегламентноеЗадание Тогда
		
		Если Не РазделениеВключено Тогда
			ВыполнитьНастройкуРасписания(РасписаниеРегламентногоЗаданияОбмена, Элементы.НастроитьРасписаниеОбмена, "ИнтервалОбменаССайтом");
		Иначе
			УстановитьРасписаниеРегламентногоЗаданияОбмена();
		КонецЕсли;
		
		Элементы.НастроитьРасписаниеОбмена.Заголовок = УстановитьНадписьРасписания(РасписаниеРегламентногоЗаданияОбмена, "ИнтервалОбменаССайтом");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРасписанияОбмена()
	
	Если Не РазделениеВключено Тогда
		Элементы.НастроитьРасписаниеОбмена.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	Иначе
		Элементы.ИнтервалОбменаССайтом.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	КонецЕсли;
	
	// №12317 Элементы.ГруппаВыгружатьИзменения.Доступность = Объект.ИспользоватьРегламентноеЗадание;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключательВыгрузкаИзмененийПриИзменении(Элемент)
	
	ПриИзмененииПереключательВыгрузкаИзменений()
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПереключательВыгрузкаИзменений()
	
	Объект.ВыгружатьИзменения = (ПереключательВыгрузкаИзменений = 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписания(РасписаниеЗадания, Элемент, СтрокаРасписания)
	
	Если РасписаниеЗадания = Неопределено Тогда
		РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеЗадания);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьНастройкуРасписанияЗавершение", ЭтотОбъект, Новый Структура("ЭлементФормы, СтрокаРасписания, Расписание", Элемент, СтрокаРасписания, РасписаниеЗадания));
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНастройкуРасписанияЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание=Неопределено Тогда
		
	Иначе
		ЭтотОбъект[ДополнительныеПараметры.СтрокаРасписания] = Расписание;
		ДополнительныеПараметры.ЭлементФормы.Заголовок = УстановитьНадписьРасписания(Расписание, ЭтотОбъект[ДополнительныеПараметры.СтрокаРасписания]);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВидыЦенНоменклатуры(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокВидовЦен", СписокВидовЦен);
	
	ОткрытьФорму("ПланОбмена.ОбменССайтом.Форма.ФормаВыбораВидовЦен",ПараметрыФормы,ЭтаФорма,,,, Новый ОписаниеОповещения("ВыбратьВидыЦенНоменклатурыЗавершение", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВидыЦенНоменклатурыЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
    
    Если РезультатВыбора <> Неопределено И ТипЗнч(РезультатВыбора) = Тип("СписокЗначений") Тогда
        
        СписокВидовЦен = РезультатВыбора;
        
        СписокВидовЦенСтрока = "";
        Для каждого ЭлементСЗ Из СписокВидовЦен Цикл
            
            СписокВидовЦенСтрока = СписокВидовЦенСтрока + ?(СписокВидовЦенСтрока = "","","; ") + ЭлементСЗ.Представление;
            
		КонецЦикла;
		Элементы.ВыбратьВидыЦенНоменклатуры.Заголовок = "Виды цен: "+СписокВидовЦенСтрока;
		
    ИначеЕсли РезультатВыбора <> Неопределено И ТипЗнч(РезультатВыбора) = Тип("СправочникСсылка.ВидыЦен") Тогда
        СписокВидовЦен.Очистить();
        СписокВидовЦен.Добавить(РезультатВыбора, РезультатВыбора);
		Элементы.ВыбратьВидыЦенНоменклатуры.Заголовок = "Вид цен: "+РезультатВыбора;
    КонецЕсли;

	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДублированиеСтатусов(ИмяКолонки)
	
	СтатусЗаказаНаСайте = Элементы.СоответствиеСтатусовЗаказов.ТекущиеДанные.СтатусЗаказаНаСайте;
	СтатусЗаказаПокупателя = Элементы.СоответствиеСтатусовЗаказов.ТекущиеДанные.СтатусЗаказаПокупателя;
	
	Если НЕ ПустаяСтрока(СтатусЗаказаНаСайте) Тогда
		Найдено = Объект.СоответствиеСтатусовЗаказов.НайтиСтроки(Новый Структура("СтатусЗаказаНаСайте", СтатусЗаказаНаСайте));
		Если Найдено.Количество() > 1 Тогда
			ИмяКолонки = "СтатусЗаказаНаСайте";
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтатусЗаказаПокупателя) Тогда
		Найдено = Объект.СоответствиеСтатусовЗаказов.НайтиСтроки(Новый Структура("СтатусЗаказаПокупателя", СтатусЗаказаПокупателя));
		Если Найдено.Количество() > 1 Тогда
			ИмяКолонки = "СтатусЗаказаКлиента";
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область УправлениеВнешнимВидомФормы

&НаКлиенте
Процедура УстановитьВидимостьСтраницТипаОбмена()
	
	Если Объект.ВыгружатьНаСайт Тогда
		Элементы.СтраницыТипОбмена.ТекущаяСтраница = Элементы.СтраницаВыгрузкаНаСайт;
	Иначе
		Элементы.СтраницыТипОбмена.ТекущаяСтраница = Элементы.СтраницаВыгрузкаВКаталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьСтраницФормы()
	
	Элементы.СтраницаВыгрузкаТоваров.Видимость = Объект.ОбменТоварами;
	Элементы.СтраницаОбменЗаказами.Видимость = Объект.ОбменЗаказами;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеФормы()
	
	УсловноеОформление.Элементы.Очистить();
	
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	//РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(НовоеУсловноеОформление.Отбор, "Объект.СоответствиеСтатусовЗаказов.РезервироватьТовар", Ложь);
	//РаботаСФормой.ДобавитьОформляемоеПоле(НовоеУсловноеОформление, Элементы.СоответствиеСтатусовЗаказовСкладРезерв.Имя);
	//РаботаСФормой.ДобавитьЭлементУсловногоОформления(НовоеУсловноеОформление, "Доступность", Ложь);
	
	ЭлементОтбора = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.СоответствиеСтатусовЗаказов.РезервироватьТовар");
	ЭлементОтбора.ПравоеЗначение = Ложь;

	ОформляемоеПоле                = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле           = Новый ПолеКомпоновкиДанных(Элементы.СоответствиеСтатусовЗаказовСкладРезерв.Имя);
	ОформляемоеПоле.Использование  = Истина;
	
	ЭлементОформление = НовоеУсловноеОформление.Оформление.Элементы.Найти("Доступность");
	ЭлементОформление.Значение      = Ложь;
	ЭлементОформление.Использование = Истина;

КонецПроцедуры

#КонецОбласти

#Область ДействияКомандныхПанелейФормы

// Процедура - обработчик команды КомандаПроверитьСоединение.
&НаКлиенте
Процедура КомандаПроверитьСоединение(Команда)
	
	Если Модифицированность Тогда
		
		Ответ = Неопределено;

		ПоказатьВопрос(Новый ОписаниеОповещения("КомандаПроверитьСоединениеЗавершение", ЭтотОбъект), 
			НСтр("ru = 'Настройка обмена изменена и не записана. Записать?'"),
			РежимДиалогаВопрос.ДаНет);
        Возврат;
		
	КонецЕсли;
	
	КомандаПроверитьСоединениеФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьСоединениеЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Ответ = Результат;
    
    Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
    
    Если НЕ Записать() Тогда
        Возврат;
    КонецЕсли;
    
    КомандаПроверитьСоединениеФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьСоединениеФрагмент()
    
    Перем ТекстПредупреждения;
    
    ТекстПредупреждения = "";
	НастройкиПодключения = Новый Структура;
	НастройкиПодключения.Вставить("ИмяПользователя", Объект.ИмяПользователя);
	НастройкиПодключения.Вставить("АдресСайта", Объект.АдресСайта);
	
    ПроверитьПодключение(НастройкиПодключения, ТекстПредупреждения);
    
    ПоказатьПредупреждение(,ТекстПредупреждения);

КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключение(НастройкиПодключения, ТекстПредупреждения)
	
	//++ №13563 логирование теперь общее
	//ДанныеУзлаОбмена = Новый Структура("УзелОбмена,ПометкаУдаления, ВыгружатьНаСайт, АдресСайта, ИмяПользователя, Пароль, ВыгружатьИзменения, ВестиЛогированиеОбмена");
	ДанныеУзлаОбмена = Новый Структура("УзелОбмена,ПометкаУдаления, ВыгружатьНаСайт, АдресСайта, ИмяПользователя, Пароль, ВыгружатьИзменения");
	
	ДанныеУзлаОбмена.Вставить("ВестиЛогированиеОбмена", Константы.ВестиЛогированиеОбменаССайтом.Получить());
	//-- №13563
	
	ЗаполнитьЗначенияСвойств(ДанныеУзлаОбмена, Объект);	
	ДанныеУзлаОбмена.Вставить("УзелОбмена", Объект.Ссылка);
	
	НастройкиПодключения.Вставить("Пароль", Объект.Пароль);
	
	ОбменССайтомCML.ВыполнитьТестовоеПодключениеКСайту(НастройкиПодключения, ТекстПредупреждения, ДанныеУзлаОбмена);
	
КонецПроцедуры

// Процедура - обработчик команды НастроитьРасписаниеОбмена.
//
&НаКлиенте
Процедура НастроитьРасписаниеОбмена(Команда)
	
	НастроитьРасписание(РасписаниеРегламентногоЗаданияОбмена, Элементы.НастроитьРасписаниеОбмена, "РасписаниеРегламентногоЗаданияОбмена");
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание(Расписание, Элемент, СтрокаРасписания)

	ВыполнитьНастройкуРасписания(Расписание, Элемент, СтрокаРасписания);
	Элемент.Заголовок = УстановитьНадписьРасписания(Расписание, СтрокаРасписания);
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитовФормы

&НаКлиенте
Процедура СоответствиеСтатусовЗаказовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = "";
	Если НЕ ПроверитьДублированиеСтатусов(ИмяКолонки) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Такой статус уже указан в другой строке таблицы!'"),
			Объект.Ссылка,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"Объект.СоответствиеСтатусовЗаказов", Объект.СоответствиеСтатусовЗаказов.Индекс(Элементы.СоответствиеСтатусовЗаказов.ТекущиеДанные) + 1, ИмяКолонки));
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода КаталогВыгрузки.
//
&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("КаталогВыгрузкиНачалоВыбораЗавершение1", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбораЗавершение1(Подключено, ДополнительныеПараметры) Экспорт
    
    Если Не Подключено Тогда
		ОтветОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершить", ЭтотОбъект);
		ЗадатьВопросУстановкиРасширения(ОтветОповещения);
		
        Возврат;
    КонецЕсли;
    
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    
    Диалог.Заголовок = НСтр("ru = 'Укажите каталог обмена'");
    Диалог.Каталог = Объект.КаталогВыгрузки;
    
    Диалог.Показать(Новый ОписаниеОповещения("КаталогВыгрузкиНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));

КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершить(Результат) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьДиалогВыбораФайла();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДиалогВыбораФайла()
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Диалог.Заголовок = НСтр("ru = 'Укажите каталог обмена'");
	Диалог.Каталог = Объект.КаталогВыгрузки;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораКаталогаВыгрузки", ЭтотОбъект);
	
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталогаВыгрузки(ВыбранныеФайлы, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Объект.КаталогВыгрузки = ВыбранныеФайлы[0];
		Модифицированность = Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросУстановкиРасширения(ОповещениеВопроса)
	
	ТекстВопроса= НСтр("ru = 'Для данной операции необходимо установить расширение работы с файлами.
							|Установить расширение работы с файлами ?'");
							
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОповещениеВопроса", ОповещениеВопроса);
	
	ОтветОповещения = Новый ОписаниеОповещения("ВопросУстановитьРасширениеЗавершить", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(ОтветОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросУстановитьРасширениеЗавершить(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		УстановитьРасширениеОповещение = ДополнительныеПараметры.ОповещениеВопроса;
		
		НачатьУстановкуРасширенияРаботыСФайлами(УстановитьРасширениеОповещение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогВыгрузкиНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    
    Диалог = ДополнительныеПараметры.Диалог;
    
    Если (ВыбранныеФайлы <> Неопределено) Тогда
        Объект.КаталогВыгрузки = Диалог.Каталог;
    КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события Открытие поля ввода КаталогВыгрузки.
//
&НаКлиенте
Процедура КаталогВыгрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПолноеИмяФайла = Объект.КаталогВыгрузки;
	
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("НачатьЗапускПриложенияЗавершить", ЭтотОбъект);
	
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода ФайлЗагрузки.
//
&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("ФайлЗагрузкиНачалоВыбораЗавершение1", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбораЗавершение1(Подключено, ДополнительныеПараметры) Экспорт
    
    Если Не Подключено Тогда
        
        ПоказатьПредупреждение(Неопределено,НСтр("ru = 'Для данной операции необходимо установить расширение работы с файлами!'"));
        Возврат;
        
    КонецЕсли;
    
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    
    Диалог.Заголовок = НСтр("ru = 'Выберите xml-файл с заказами'");
    Диалог.ПолноеИмяФайла = Объект.ФайлЗагрузки;
    Диалог.Фильтр = НСтр("ru = 'Документ XML'") + " (*.xml)|*.xml";
    
    Диалог.Показать(Новый ОписаниеОповещения("ФайлЗагрузкиНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));

КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    
    Диалог = ДополнительныеПараметры.Диалог;
    
    Если (ВыбранныеФайлы <> Неопределено) Тогда
        
        Объект.ФайлЗагрузки = Диалог.ПолноеИмяФайла;
        
    КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события Открытие поля ввода ФайлЗагрузки.
//
&НаКлиенте
Процедура ФайлЗагрузкиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПолноеИмяФайла = Объект.ФайлЗагрузки;
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ФайлЗагрузкиОткрытиеЗавершить", ЭтотОбъект);
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиОткрытиеЗавершить(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Не Подключено Тогда
		
		ОповещениеВопроса = Новый ОписаниеОповещения("ФайлЗагрузкиВопросЗавершить", ЭтотОбъект);
		ЗадатьВопросУстановкиРасширения(ОповещениеВопроса);
		
	Иначе
		
		ОткрытьФайлОбменаЗаказами();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиВопросЗавершить(Результат) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФайлОбменаЗаказами();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлОбменаЗаказами()
	
	//ФайловаяСистемаКлиент.ЗапуститьПрограмму("explorer.exe /select, " + Объект.ФайлЗагрузки);
	Оповещение = ПустоеОповещение();
	
	ИмяСкрипта = "explorer.exe /select, " + Объект.ФайлЗагрузки;
	НачатьЗапускПриложения(Оповещение, ИмяСкрипта);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗапускПриложенияЗавершить(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Не Подключено Тогда
		
		ОтветОповещения = Новый ОписаниеОповещения("ОткрытьКаталогЗавершить", ЭтотОбъект);
		
		ЗадатьВопросУстановкиРасширения(ОтветОповещения);
		
	Иначе
		
		ОткрытьКаталогОбмена();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКаталогОбмена()
	
	//ФайловаяСистемаКлиент.ЗапуститьПрограмму(Объект.КаталогВыгрузки);
	Оповещение = ПустоеОповещение();	
	ПолноеИмяФайла = Объект.КаталогВыгрузки;	
	НачатьЗапускПриложения(Оповещение, ПолноеИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Функция ПустоеОповещение()
	
	Оповещение = Новый ОписаниеОповещения("ПустойОбработчик", ЭтотОбъект);
	
	Возврат Оповещение;

КонецФункции

&НаКлиенте
Процедура ПустойОбработчик(Результат, ДополнительныеПараметры) Экспорт
	
	// Действий не требуется.
	Возврат;
	
КонецПроцедуры

// Процедура - обработчик события НачалоВыбора поля ввода Комментарий.
//
&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Комментарий");
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля переключателя ПереключательНазначениеОбмена.
//
&НаКлиенте
Процедура ПереключательНазначениеОбменаПриИзменении(Элемент)
	
	ПриИзмененииПереключательНазначениеОбмена();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля флажка ИспользоватьРегламентныеЗадания.
//
&НаКлиенте
Процедура ИспользоватьРегламентныеЗаданияПриИзменении(Элемент)
	
	ПриИзмененииИспользоватьРегламентныеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОбменаССайтомПриИзменении(Элемент)
	
	УстановитьРасписаниеРегламентногоЗаданияОбмена();
	Элементы.НастроитьРасписаниеОбмена.Заголовок = УстановитьНадписьРасписания(РасписаниеРегламентногоЗаданияОбмена, "ИнтервалОбменаССайтом");
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля флажка ОбменТоварами.
//
&НаКлиенте
Процедура ОбменТоварамиПриИзменении(Элемент)
	
	УстановитьВидимостьСтраницФормы();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля флажка ОбменЗаказами.
//
&НаКлиенте
Процедура ОбменЗаказамиПриИзменении(Элемент)
	
	ПриИзмененииОбменЗаказами();
	
КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода СпособИдентификацииКонтрагентов.
//
&НаКлиенте
Процедура СпособИдентификацииКонтрагентовПриИзменении(Элемент)
	
	ПриИзмененииСпособИдентификацииКонтрагентов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусЗаказаПокупателя()
	
	Возврат Справочники.СтатусыЗаказовПокупателей.НачальныйСтатус();
	
КонецФункции

&НаКлиенте
Процедура РежимВыгрузкиЦенПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоискаКонтрагентовНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ШаблонНастройкиПоискаКонтрагентов = ОбменССайтомCML.ПоляПоискаКонтрагентов();
	НастройкиПоиска = ОбщийМодульВызовСервера.ЧтениеJSONВСтруктуру(Объект.НастройкиПоискаКонтрагентов);
	
	Для каждого стр Из ШаблонНастройкиПоискаКонтрагентов Цикл
		
		ИмяПоляПоиска = стр.Получить("Значение");
		СохраненныеНастройки = НастройкиПоиска.Получить(ИмяПоляПоиска);
		Если СохраненныеНастройки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого сохраненноеЗначение Из СохраненныеНастройки Цикл
			
			Если стр.Получить(сохраненноеЗначение.Ключ) <> Неопределено Тогда
			
				стр.Вставить(сохраненноеЗначение.Ключ, сохраненноеЗначение.Значение);
			
			КонецЕсли;
		
		КонецЦикла;
	КонецЦикла;
	
	Если НастройкиПоиска.Получить("ВариантПоиска")<>Неопределено Тогда
		ВариантПоиска = НастройкиПоиска.Получить("ВариантПоиска");
	Иначе
		ВариантПоиска = 0;
	КонецЕсли;
	
	СоответствиеНастроек = Новый Структура("НастройкиПоиска", ШаблонНастройкиПоискаКонтрагентов);
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("НастройкиПоискаСоответствие", СоответствиеНастроек);
	ПараметрыОткрытия.Вставить("ВариантПоиска", ВариантПоиска);
	ПараметрыОткрытия.Вставить("ЗаголовокФормы", НСтр("ru = 'Настройки сопоставления контрагентов при загрузке с сайта'"));
	ПараметрыОткрытия.Вставить("ЗаголовокПоляПоиска", НСтр("ru = 'Данные сайта для поиска покупателя в 1С'"));
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкиПоискаПоКонтактнойИнформацииЗакрытие", ЭтотОбъект);
	
	ОткрытьФорму("ПланОбмена.ОбменССайтом.Форма.НастройкиПоискаПоКонтактнойИнформации", ПараметрыОткрытия, ЭтотОбъект
		,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоискаПоКонтактнойИнформацииЗакрытие(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия<>Неопределено И ТипЗнч(РезультатЗакрытия) = Тип("Соответствие") Тогда
		
		НастройкиПоискаКонтрагентовПредставление = ПоискКонтрагентовПредставление(РезультатЗакрытия);
		Объект.НастройкиПоискаКонтрагентов = ОбщийМодульВызовСервера.ЗаписьJSONВСтруктуру(РезультатЗакрытия);
		ЭтотОбъект.Модифицированность = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПоискКонтрагентовПредставление(СоответствиеНастройки)
	
	СтрокаПредставление = "";
	СписокНастроекВПорядкеПриоритета = Новый СписокЗначений;
	Для каждого элНастройки Из СоответствиеНастройки Цикл
		
		Если элНастройки.Ключ = "ВариантПоиска" ИЛИ элНастройки.Ключ = "СовпадениеВсехПолей" Тогда
			Продолжить;
		КонецЕсли;
		
		Если элНастройки.Значение.Получить("Пометка") = Истина Тогда
			
			ЗначениеНастройки = элНастройки.Значение.Получить("Значение");
			Если ЗначениеНастройки = "Основной телефон" Тогда
				ЗначениеНастройки = "Телефон";
			ИначеЕсли ЗначениеНастройки = "Основной Email" Тогда
				ЗначениеНастройки = "Email";
			КонецЕсли;				
			
			СписокНастроекВПорядкеПриоритета.Добавить(элНастройки.Значение.Получить("Порядок"), ЗначениеНастройки);
		
		КонецЕсли;
	
	КонецЦикла;
	
	СписокНастроекВПорядкеПриоритета.СортироватьПоЗначению();
	
	Для каждого СтрокаНастроек Из СписокНастроекВПорядкеПриоритета Цикл
		СтрокаПредставление = СтрокаПредставление + СтрокаНастроек + ", ";
	КонецЦикла;
	
	Если СтрокаПредставление="" Тогда
		СтрокаПредставление = "<Настройка не заполнена>";
	Иначе
		СтрокаПредставление = Лев(СтрокаПредставление, СтрДлина(СтрокаПредставление)-2);
	КонецЕсли;
	
	Возврат СтрокаПредставление;
	
КонецФункции

//++ №8431
&НаКлиенте
Процедура ТолькоСоздаватьНовыеЗаказыПриИзменении(Элемент)
	
	Если Объект.ТолькоСоздаватьНовыеЗаказы И Объект.ОбновлятьТолькоНеПроведенныеЗаказыПриЗагрузке Тогда
		Объект.ОбновлятьТолькоНеПроведенныеЗаказыПриЗагрузке = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлятьТолькоНеПроведенныеЗаказыПриЗагрузкеПриИзменении(Элемент)
	
	Если Объект.ОбновлятьТолькоНеПроведенныеЗаказыПриЗагрузке И Объект.ТолькоСоздаватьНовыеЗаказы Тогда
		Объект.ТолькоСоздаватьНовыеЗаказы = Ложь;
	КонецЕсли;
	
КонецПроцедуры
//-- №8431

#КонецОбласти

#Область ТаблицаКаталогов

// Процедура - обработчик события ПередОкончаниемРедактирования таблицы ТаблицаКаталогов.
//
&НаКлиенте
Процедура ТаблицаКаталоговПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Отказ = НЕ ПроверитьУникальностьИдентификатора();
	
КонецПроцедуры

// Процедура - обработчик события ПриОкончанииРедактирования таблицы ТаблицаКаталогов.
//
&НаКлиенте
Процедура ТаблицаКаталоговПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные = НеОпределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьВыбранныеГруппыСерверБезКонтекста(Элемент.ТекущиеДанные.Группы, НадписьВсеЭлементыСписка, Элементы.ТаблицаКаталоговГруппыКатегории.ВыборГруппИЭлементов);
	
	Если ПустаяСтрока(Элемент.ТекущиеДанные.ИдентификаторКаталога) Тогда
		Элемент.ТекущиеДанные.ИдентификаторКаталога = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	Если ПустаяСтрока(Элемент.ТекущиеДанные.Каталог) Тогда
		Элемент.ТекущиеДанные.Каталог = НСтр("ru = 'Каталог товаров'") + " " + ВРег(СокрЛП(Лев(Элемент.ТекущиеДанные.ИдентификаторКаталога, 8)));
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьВыбранныеГруппыСерверБезКонтекста(СписокГрупп, НадписьВсеЭлементыСписка, ВыборГруппИЭлементов)
	
	ГруппыВыбраны = Ложь;
	
	Если ВыборГруппИЭлементов = ГруппыИЭлементы.Группы Тогда
		// Удаляем не группы номенклатуры.
		МассивУдалить = Новый Массив;
		Для Каждого ЭлементСЗ Из СписокГрупп Цикл
			
			ТекГруппа = ЭлементСЗ.Значение;
			Если ЗначениеЗаполнено(ТекГруппа) И НЕ ТекГруппа.ЭтоГруппа Тогда
				МассивУдалить.Добавить(ЭлементСЗ);
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ТекГруппа) Тогда
				ЭлементСЗ.Представление = Строка(ЭлементСЗ.Значение);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекГруппа) И НЕ ЗначениеЗаполнено(ЭлементСЗ.Представление) Тогда
				ЭлементСЗ.Представление = НСтр("ru = '<Нет группы>'");
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого ЭлементМУ Из МассивУдалить Цикл
			СписокГрупп.Удалить(ЭлементМУ);
		КонецЦикла;
	КонецЕсли;
	
	// Удаляем дубли и подчиненные элементы.
	МассивУдалить = Новый Массив;
	Для Каждого ЭлементСЗ Из СписокГрупп Цикл
		
		Если НЕ МассивУдалить.Найти(ЭлементСЗ) = НеОпределено Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ТекГруппа = ЭлементСЗ.Значение;
		
		Для Каждого ЭлементСЗВлож Из СписокГрупп Цикл

			Если НЕ МассивУдалить.Найти(ЭлементСЗВлож) = НеОпределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекГруппа)
				ИЛИ НЕ ЗначениеЗаполнено(ЭлементСЗВлож.Значение) Тогда
				//Пропускаем элемент "Все" и "Нет группы"
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЭлементСЗВлож = ЭлементСЗ
				И ЭлементСЗВлож.Значение = ТекГруппа Тогда
				
				МассивУдалить.Добавить(ЭлементСЗВлож);
				
			Иначе
				
				Если ЭлементСЗВлож.Значение.ПринадлежитЭлементу(ТекГруппа) Тогда
				
					МассивУдалить.Добавить(ЭлементСЗВлож);
				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ЭлементМУ Из МассивУдалить Цикл
		
		СписокГрупп.Удалить(ЭлементМУ);
		
	КонецЦикла;
	
	Для Каждого ЭлементСЗ Из СписокГрупп Цикл
		
		Если ЗначениеЗаполнено(ЭлементСЗ.Значение) ИЛИ ЗначениеЗаполнено(ЭлементСЗ.Представление) Тогда
			
			ГруппыВыбраны = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ГруппыВыбраны Тогда
		
		СписокГрупп.Очистить();
		СписокГрупп.Добавить(Неопределено, НадписьВсеЭлементыСписка);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПослеУдаления таблицы ТаблицаКаталогов.
//
&НаКлиенте
Процедура ТаблицаКаталоговПослеУдаления(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

// Процедура - обработчик события ПриНачалеРедактирования таблицы ТаблицаКаталогов.
//
&НаКлиенте
Процедура ТаблицаКаталоговПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		
		Элемент.ТекущиеДанные.ИдентификаторКаталога = "";
		
	КонецЕсли;

	Если (Элемент.ТекущиеДанные.Группы.Количество() = 1
		И НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Группы[0].Значение) 
		И Элемент.ТекущиеДанные.Группы[0].Представление = НадписьВсеЭлементыСписка)
		ИЛИ Элемент.ТекущиеДанные.Группы.Количество() = 0 Тогда
			
		НовыйСписокГрупп = Новый СписокЗначений;
		
		Если Объект.ОтборГруппыКатегорииНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.ГруппыНоменклатуры") Тогда
			ТипЗначений = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
			Элементы.ТаблицаКаталоговГруппыКатегории.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
		Иначе
			ТипЗначений = Новый ОписаниеТипов("СправочникСсылка.КатегорияНоменклатуры");
			Элементы.ТаблицаКаталоговГруппыКатегории.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
		КонецЕсли;
		
		НовыйСписокГрупп.ТипЗначения = ТипЗначений;
		НовыйСписокГрупп.Добавить(Неопределено, НадписьВсеЭлементыСписка);
		Элемент.ТекущиеДанные.Группы = НовыйСписокГрупп;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСтруктурыКаталогаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	Элементы.ТаблицаКаталогов.ТекущиеДанные.РучнаяНастройкаКаталога = Результат.ДетализацияОтбора;
	Элементы.ТаблицаКаталогов.ТекущиеДанные.АдресНастроекСтруктурыКаталога = Результат.АдресВХранилище;

КонецПроцедуры // ОткрытьФормуОтбораКаталога()

Процедура ТаблицаКаталоговСохранить(ТекущийОбъект)

	ТаблицаКаталоговТЗ = ДанныеФормыВЗначение(ТаблицаКаталогов, Тип("ТаблицаЗначений"));
	ТаблицаКаталоговТЗ.Колонки.Добавить("ХранилищеНастроекКомпоновки", Новый ОписаниеТипов("ХранилищеЗначения"));
	
	Для Каждого СтрокаТаблицыКаталогов Из ТаблицаКаталоговТЗ Цикл
		
		Если ЭтоАдресВременногоХранилища(СтрокаТаблицыКаталогов.АдресНастроекКомпоновки) Тогда
			НастройкиКомпоновки = ПолучитьИзВременногоХранилища(СтрокаТаблицыКаталогов.АдресНастроекКомпоновки);
			СтрокаТаблицыКаталогов.ХранилищеНастроекКомпоновки = Новый ХранилищеЗначения(НастройкиКомпоновки);
		КонецЕсли;
		
		ОбновитьНастройкиСтруктурыКаталога(СтрокаТаблицыКаталогов);
	КонецЦикла;
	
	ТаблицаКаталоговТЗ.Колонки.Удалить("АдресНастроекКомпоновки");
	ТаблицаКаталоговТЗ.Колонки.Удалить("АдресНастроекСтруктурыКаталога");
	
	ТекущийОбъект.СохраненнаяТаблицаКаталогов = Новый ХранилищеЗначения(ТаблицаКаталоговТЗ);
	
	ОчиститьУдаленныеНастройкиСтруктурыКаталога();

КонецПроцедуры
 
&НаСервере
Процедура УстановитьТипЗначенийСпискаГруппТаблицыКаталоговСервер()
	
	Если Объект.ОтборГруппыКатегорииНоменклатуры = Перечисления.ВидыОтборовНоменклатуры.ГруппыНоменклатуры Тогда
		ТипЗначений = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	Иначе
		ТипЗначений = Новый ОписаниеТипов("СправочникСсылка.КатегорияНоменклатуры");
	КонецЕсли;	
	
	Для Каждого СтрокаТаблицыКаталогов Из ТаблицаКаталогов Цикл
		СтрокаТаблицыКаталогов.Группы.ТипЗначения = ТипЗначений;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыТаблицыКаталоговСервер()
	
	ЗаголовокТаблицы = НСтр("ru = 'Таблица каталогов (соответствие групп номенклатуры каталогам на сайте)'");
	Если Объект.ОтборГруппыКатегорииНоменклатуры = Перечисления.ВидыОтборовНоменклатуры.ГруппыНоменклатуры Тогда
		ЗаголовокКолонки = НСтр("ru = 'Группы номенклатуры'");
		ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе
		ЗаголовокКолонки = НСтр("ru = 'Категории номенклатуры'");
		ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	КонецЕсли;
	
	Элементы.ГруппаТаблицаКаталогов.Заголовок = ЗаголовокТаблицы;
	Элементы.ТаблицаКаталоговГруппыКатегории.Заголовок = ЗаголовокКолонки;
	Элементы.ТаблицаКаталоговГруппыКатегории.ВыборГруппИЭлементов = ВыборГруппИЭлементов;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуКаталоговСервер()
	
	НадписьВсеЭлементыСписка = "(" + НСтр("ru = 'Все'") + ")";
	
	СохраненнаяТаблицаКаталогов = РеквизитФормыВЗначение("Объект").СохраненнаяТаблицаКаталогов.Получить();
	
	Если НЕ ТипЗнч(СохраненнаяТаблицаКаталогов) = Тип("ТаблицаЗначений") Тогда
		
		СоздатьКаталогПоУмолчаниюСервер();
		
	Иначе
		
		Для Каждого СтрокаСохраненнойТаблицыКаталогов Из СохраненнаяТаблицаКаталогов Цикл
			
			НоваяСтрока = ТаблицаКаталогов.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСохраненнойТаблицыКаталогов);
			
			ХранилищеНастроекКомпоновки = СтрокаСохраненнойТаблицыКаталогов.ХранилищеНастроекКомпоновки.Получить();
			НоваяСтрока.АдресНастроекКомпоновки = ПоместитьВоВременноеХранилище(ХранилищеНастроекКомпоновки, УникальныйИдентификатор);
			
		КонецЦикла;
		
		Если ТаблицаКаталогов.Количество() = 0 Тогда
			
			СоздатьКаталогПоУмолчаниюСервер();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКаталогПоУмолчаниюСервер()
	
	НоваяСтрока = ТаблицаКаталогов.Добавить();
	НоваяСтрока.Каталог = НСтр("ru = 'Основной каталог товаров'");
	НоваяСтрока.Группы.Добавить(Неопределено, НадписьВсеЭлементыСписка);
	НоваяСтрока.ИдентификаторКаталога = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКаталоговГруппыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Группы = Элементы.ТаблицаКаталогов.ТекущиеДанные.Группы;
	
	Если Группы.Количество() = 1 Тогда
		
		Если НЕ ЗначениеЗаполнено(Группы[0].Значение) 
			И Объект.ОтборГруппыКатегорииНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.КатегорииНоменклатуры") Тогда
			
			Группы.Очистить();
		ИначеЕсли НЕ ЗначениеЗаполнено(Группы[0].Значение) И Группы[0].Представление = НадписьВсеЭлементыСписка Тогда
			Группы.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтбораКаталога(АдресНастроекКомпоновки)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АдресНастроекКомпоновки", АдресНастроекКомпоновки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуОтбораКаталогаЗавершение", ЭтотОбъект);
	
	РежимОткрытия = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ОткрытьФорму("ПланОбмена.ОбменССайтом.Форма.ФормаНастройкиОтбора", ПараметрыФормы, ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтбораКаталогаЗавершение(НастройкиКомпоновки, ДополнительныеПараметры) Экспорт

	Если НастройкиКомпоновки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	АдресНастроекКомпоновки = ПоместитьВоВременноеХранилище(НастройкиКомпоновки, УникальныйИдентификатор);
	
	Элементы.ТаблицаКаталогов.ТекущиеДанные.АдресНастроекКомпоновки = АдресНастроекКомпоновки;

КонецПроцедуры // ОткрытьФормуОтбораКаталога()

&НаКлиенте
Функция ПроверитьУникальностьИдентификатора()
	
	ИдентификаторКаталога = Элементы.ТаблицаКаталогов.ТекущиеДанные.ИдентификаторКаталога;
	Найдено = ТаблицаКаталогов.НайтиСтроки(Новый Структура("ИдентификаторКаталога", ИдентификаторКаталога));
	ИдентификаторыУникальны = Найдено.Количество() = 1;
	
	Если НЕ ИдентификаторыУникальны Тогда
		
		ОчиститьСообщения();
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru = 'Идентификатор каталога должен быть уникальным!'"),
			Объект.Ссылка,
			ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
				"ТаблицаКаталогов", ТаблицаКаталогов.Индекс(Элементы.ТаблицаКаталогов.ТекущиеДанные) + 1, "ИдентификаторКаталога"));
	
	КонецЕсли;
	
	Возврат ИдентификаторыУникальны;
	
КонецФункции

// Процедура - обработчик команды НастроитьОтбор.
//
&НаКлиенте
Процедура НастроитьОтбор(Команда)
	
	Если Элементы.ТаблицаКаталогов.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуОтбораКаталога(Элементы.ТаблицаКаталогов.ТекущиеДанные.АдресНастроекКомпоновки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборГруппыКатегорииНоменклатурыПриИзменении(Элемент)
	
	Если ТаблицаКаталогов.Количество()>0 Тогда
		ТаблицаКаталогов.Очистить();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("УстановитьПараметрыТаблицыКаталоговКлиент", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыТаблицыКаталоговКлиент()
	
	ЗаголовокТаблицы = НСтр("ru = 'Таблица каталогов (соответствие групп номенклатуры каталогам на сайте)'");
	Если Объект.ОтборГруппыКатегорииНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.ГруппыНоменклатуры") Тогда
		ЗаголовокКолонки = НСтр("ru = 'Группы номенклатуры'");
		ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
	Иначе
		ЗаголовокКолонки = НСтр("ru = 'Категории номенклатуры'");
		ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	КонецЕсли;
	
	Элементы.ГруппаТаблицаКаталогов.Заголовок = ЗаголовокТаблицы;
	Элементы.ТаблицаКаталоговГруппыКатегории.Заголовок = ЗаголовокКолонки;
	Элементы.ТаблицаКаталоговГруппыКатегории.ВыборГруппИЭлементов = ВыборГруппИЭлементов;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКаталоговПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьКаталогЗавершение", ЭтотОбъект), 
		НСтр("ru = 'Настройки структуры каталога и идентификатор каталога будут удалены. Продолжить?'"),
		РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКаталогЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Модифицированность = Истина;
		ТаблицаКаталогов.Удалить(Элементы.ТаблицаКаталогов.ТекущаяСтрока);		
    КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройкиСтруктурыКаталога(СтрокаТаблицыКаталогов)
	
	Если НЕ ЗначениеЗаполнено(СтрокаТаблицыКаталогов.АдресНастроекСтруктурыКаталога) Тогда
		// не было изменений
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ОбменССайтомСтруктураКаталога.СоздатьНаборЗаписей();
	НЗ.Отбор.УзелОбмена.Установить(Объект.Ссылка);
	НЗ.Отбор.ИдентификаторКаталога.Установить(СтрокаТаблицыКаталогов.ИдентификаторКаталога);
	
	СохраненныеДанные = ПолучитьИзВременногоХранилища(СтрокаТаблицыКаталогов.АдресНастроекСтруктурыКаталога);
	СохраненныеДанные.ЗаполнитьЗначения(СтрокаТаблицыКаталогов.ИдентификаторКаталога, "ИдентификаторКаталога");
	СохраненныеДанные.Свернуть("УзелОбмена, ИдентификаторКаталога, Номенклатура, ГруппаКаталога, РодительИдентификатор, 
		|Идентификатор, РодительГруппа, РодительКатегория, ЭтоГруппа");
	
	НЗ.Загрузить(СохраненныеДанные);
	НЗ.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьУдаленныеНастройкиСтруктурыКаталога()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбменССайтомСтруктураКаталога.ИдентификаторКаталога КАК ИдентификаторКаталога
	|ИЗ
	|	РегистрСведений.ОбменССайтомСтруктураКаталога КАК ОбменССайтомСтруктураКаталога
	|ГДЕ
	|	ОбменССайтомСтруктураКаталога.УзелОбмена = &УзелОбмена";
	Запрос.УстановитьПараметр("УзелОбмена", Объект.Ссылка);
	
	СохраненныеИдентификаторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторКаталога");
	Для каждого Идентификатор Из СохраненныеИдентификаторы Цикл
	
		Если ТаблицаКаталогов.НайтиСтроки(Новый Структура("ИдентификаторКаталога", Идентификатор)).Количество() = 0 Тогда
			
			НЗ = РегистрыСведений.ОбменССайтомСтруктураКаталога.СоздатьНаборЗаписей();
			НЗ.Отбор.УзелОбмена.Установить(Объект.Ссылка);
			НЗ.Отбор.ИдентификаторКаталога.Установить(Идентификатор);
			НЗ.Записать(Истина);
		
		КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКаталоговИдентификаторКаталогаИзменениеТекстаРедактирования(ИдентификаторыКаталога)
	
	ТекДанные = Элементы.ТаблицаКаталогов.ТекущиеДанные;
	Элементы.ТаблицаКаталогов.ТекущиеДанные.АдресНастроекСтруктурыКаталога = ПрочитатьНастройкиКаталогаВоВременноеХранилище(ТекДанные.ИдентификаторКаталога);
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьНастройкиКаталогаВоВременноеХранилище(ИдентификаторКаталога)
	
	НЗ = РегистрыСведений.ОбменССайтомСтруктураКаталога.СоздатьНаборЗаписей();
	НЗ.Отбор.УзелОбмена.Установить(Объект.Ссылка);
	НЗ.Отбор.ИдентификаторКаталога.Установить(ИдентификаторКаталога);
	НЗ.Прочитать();
	
	Возврат ПоместитьВоВременноеХранилище(НЗ.Выгрузить(), ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ТаблицаКаталоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент.Имя = "ТаблицаКаталоговСтруктураКаталога" Тогда
		
		ТекДанные = Элемент.ТекущиеДанные;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Ключ", Объект.Ссылка);
		СтруктураПараметров.Вставить("ОтборГруппыКатегорииНоменклатуры", Объект.ОтборГруппыКатегорииНоменклатуры);
		СтруктураПараметров.Вставить("ТаблицаКаталоговГруппы", ТекДанные.Группы);
		СтруктураПараметров.Вставить("ИдентификаторКаталога", ТекДанные.ИдентификаторКаталога);
		СтруктураПараметров.Вставить("АдресНастроекСтруктурыКаталога", ТекДанные.АдресНастроекСтруктурыКаталога);
		СтруктураПараметров.Вставить("РучнаяНастройкаКаталога", ТекДанные.РучнаяНастройкаКаталога);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаСтруктурыКаталогаЗавершение", ЭтотОбъект);
		
		ОткрытьФорму("ПланОбмена.ОбменССайтом.Форма.НастройкаСтруктурыКаталога", СтруктураПараметров, ЭтотОбъект,,,,ОписаниеОповещения);
		
	КонецЕсли;	
	
КонецПроцедуры

//++ №13563 логирование теперь общее
//&НаКлиенте
//Процедура ВестиЛогированиеОбменаПриИзменении(Элемент)
//	
//	УстановитьВидимостьИДоступностьЭлементов();

//	ВестиЛогированиеОбменаПриИзмененииНаСервере();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ВестиЛогированиеОбменаПриИзмененииНаСервере()
//	
//	Если Объект.ВестиЛогированиеОбмена Тогда
//		Объект.ЛогСобытийОтключитьПосле = ТекущаяДата() + 3*60*60; // именно ТекущаяДата()
//	Иначе
//		Объект.ЛогСобытийОтключитьПосле = Дата(1, 1, 1);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбрезатьИсториюОбменовПриИзменении(Элемент)
//	
//	УстановитьВидимостьИДоступностьЭлементов();
//	
//КонецПроцедуры
//-- №13563 логирование теперь общее

#КонецОбласти
