&НаСервере
Функция СформироватьЭлектронноеПисьмоСОтчетом()
	
	ЗначениеОтбораКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	ЗначениеОтбораПериодНачало = Дата(1,1,1);
	ЗначениеОтбораПериодКонец = Дата(1,1,1);
	
	ИдентификаторПользовательскойНастройки = "";
	ПолеКонтрагент = Новый ПолеКомпоновкиДанных("Контрагент");
	Для каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	    Если ЭлементОтбора.ЛевоеЗначение = ПолеКонтрагент Тогда
	        ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
	    КонецЕсли; 
	КонецЦикла;
	Если НЕ ПустаяСтрока(ИдентификаторПользовательскойНастройки) Тогда
	    ПользовательскийОтбор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
		ЗначениеОтбораКонтрагент = ПользовательскийОтбор.ПравоеЗначение;
	КонецЕсли;
	
	ИдентификаторПользовательскойНастройки = "";
    ПолеКонтрагент = Новый ПолеКомпоновкиДанных("НачалоПериода");
    Для каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
        Если ЭлементОтбора.ЛевоеЗначение = ПолеКонтрагент Тогда
            ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
        КонецЕсли; 
	КонецЦикла;
	Если НЕ ПустаяСтрока(ИдентификаторПользовательскойНастройки) Тогда
        ПользовательскийОтбор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
		ЗначениеОтбораПериодНачало = ПользовательскийОтбор.ПравоеЗначение;
	КонецЕсли;
	
	ИдентификаторПользовательскойНастройки = "";
    ПолеКонтрагент = Новый ПолеКомпоновкиДанных("КонецПериода");
    Для каждого ЭлементОтбора Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
        Если ЭлементОтбора.ЛевоеЗначение = ПолеКонтрагент Тогда
            ИдентификаторПользовательскойНастройки = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
        КонецЕсли; 
	КонецЦикла;
	Если НЕ ПустаяСтрока(ИдентификаторПользовательскойНастройки) Тогда
        ПользовательскийОтбор = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ИдентификаторПользовательскойНастройки);
		ЗначениеОтбораПериодКонец = ПользовательскийОтбор.ПравоеЗначение;
	КонецЕсли;

	
	Возврат РаботаСЭлектроннойПочтой.СформироватьЭлектронноеПисьмоСОтчетом(Результат, "Анализ заказов на производство сверки с " + Формат(ЗначениеОтбораПериодНачало,"ДЛФ=Д") + " по " + Формат(ЗначениеОтбораПериодКонец,"ДЛФ=Д"), 
	ЗначениеОтбораКонтрагент, "xls");
		
КонецФункции

&НаСервере
Функция ПолучитьКоличествоСтраницВОтчете()
	Возврат Результат.КоличествоСтраниц();
КонецФункции

&НаКлиенте
Процедура ОтправитьПоПочте(Команда)
	Если ПолучитьКоличествоСтраницВОтчете() = 0 Тогда
		ПоказатьОповещениеПользователя("Сначала необходимо сформировать отчет");
		Возврат;
	КонецЕсли;
		
	Если Вопрос("Создать новое электронное письмо?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		СсылкаНаЭлектронноеПисьмо = СформироватьЭлектронноеПисьмоСОтчетом();
		
		Парам = Новый Структура("Ключ",СсылкаНаЭлектронноеПисьмо);
		ОткрытьФорму("Документ.ЭлектронноеПисьмо.ФормаОбъекта",Парам);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	   
КонецПроцедуры


&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриЗагрузкеПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Настройки);	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СохранитьПользовательскиеНастройкиНаСервере();	
КонецПроцедуры

&НаСервере
Процедура СохранитьПользовательскиеНастройкиНаСервере()
	МодульОтчетов.ДействияПриСохраненииПользовательскихНастроекНаСервере(Отчет,РеквизитФормыВЗначение("Отчет").ЭтотОбъект.Метаданные().Имя,Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
КонецПроцедуры	

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода").Значение = НачалоМесяца(ТекущаяДатаСеанса());
    Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода").Использование = Истина;
	
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода").Значение = КонецМесяца(ТекущаяДатаСеанса());
    Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода").Использование = Истина;
    
КонецПроцедуры

