
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено тогда
		Описание = "";
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Свойство("ГруппировкаСтроки") и ЗначениеЗаполнено(ТекущиеДанные.ГруппировкаСтроки) Тогда
		Описание = "";
		Возврат;
	КонецЕсли; 
	
	Если ТекущиеДанные = Неопределено Или ТекущиеДанные.ЭтоГруппа ТОгда
		Описание = "";
		Возврат;
	КонецЕсли;
	
	Описание = ТекущиеДанные.Описание;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Аналитика1) Тогда
		
		Описание = Описание + Символы.ПС + Символы.ПС + "Статистика содержит следующие детализации:" + Символы.ПС + ТекущиеДанные.Аналитика1;
		Если ЗначениеЗаполнено(ТекущиеДанные.Аналитика2) Тогда
			Описание = Описание + Символы.ПС + ТекущиеДанные.Аналитика2;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекущиеДанные.Аналитика3) Тогда
			Описание = Описание + Символы.ПС + ТекущиеДанные.Аналитика3;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
