Функция ПолучитьСписокЗамеров(ВходнаяСтруктура)
	
	Структура = Десериализовать(ВходнаяСтруктура);
	//Пользователь = Справочники.Пользователи.НайтиПоНаименованию(Структура.User).Сотрудник.Ссылка;
	//ДатаЗамера = Структура.Date;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Замеры.Дата,
	|	Замеры.Сотрудник,
	|	Замеры.ВремяНачала,
	|	Замеры.ВремяОкончания,
	|	Замеры.Замер.Номер,
	|	Замеры.ИмяКлиента,
	|	Замеры.Адрес,
	|	Замеры.Результат
	|ИЗ
	|	РегистрСведений.Замеры КАК Замеры
	|ГДЕ
	|	Замеры.Дата = &ДатаЗамера
	|	И Замеры.Сотрудник = &Пользователь";
	//Запрос.УстановитьПараметр("ДатаЗамера",ДатаЗамера);
	//Запрос.УстановитьПараметр("Пользователь",Пользователь);
	
	Возврат Запрос.Выполнить().Выгрузить().Количество();
	
КонецФункции

Функция Десериализовать(XMLОбъект)
	
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLОбъект);
	ПолученныйОбъект = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();
	Возврат ПолученныйОбъект;
	
КонецФункции