Функция НоменклатураПринадлежитОперации(Операция, Номенклатура) Экспорт

	Результат = Ложь;
	
	Если НЕ Операция.УДАЛИТЬ_СписокНоменклатуры.Найти(Номенклатура,"Номенклатура") = Неопределено Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Если НЕ Результат Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
		Отбор.Вставить("ВидНоменклатуры", Номенклатура.ВидНоменклатуры);
		НайденныеСтроки = Операция.УДАЛИТЬ_СписокНоменклатуры.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Результат = Истина;
		КонецЕсли;
		//Если НЕ Операция.СписокНоменклатуры.Найти(Номенклатура.ВидНоменклатуры,"ВидНоменклатуры") = Неопределено Тогда
		//	Результат = Истина;
		//КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтоимостьОпределятьПоВыработке(Операция, Номенклатура) Экспорт
	
	ИскомаяСтрока = Операция.УДАЛИТЬ_СписокНоменклатуры.Найти(Номенклатура,"Номенклатура");
	
	Если НЕ ИскомаяСтрока = Неопределено Тогда
		Возврат ИскомаяСтрока.КоличествоПоВыработке;
	Иначе
		
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
		Отбор.Вставить("ВидНоменклатуры", Номенклатура.ВидНоменклатуры);
		НайденныеСтроки = Операция.УДАЛИТЬ_СписокНоменклатуры.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0].КоличествоПоВыработке;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	
КонецФункции

Функция ПолучитьСтоимостьВыработкиПоВидуПотолка(Операция, НоменклатураПотолок, Номенклатура) Экспорт
	
	Результат = 0;
	СтрокаЦены = Операция.УДАЛИТЬ_СписокНоменклатуры.Найти(Номенклатура,"Номенклатура");
	Если СтрокаЦены = Неопределено Тогда
		СтрокаЦены = Операция.УДАЛИТЬ_СписокНоменклатуры.Найти(Номенклатура.ВидНоменклатуры,"ВидНоменклатуры");
	КонецЕсли;
	
	Если НЕ СтрокаЦены = Неопределено Тогда
		Если НоменклатураПотолок.Потолок_ОбщаяДлинаГарпуна = 0 Тогда
			Если НоменклатураПотолок.Потолок_Многфактурный Тогда
				Результат = СтрокаЦены.СтоимостьВыработкиМногофактурныйОтрез;
			Иначе
				Результат = СтрокаЦены.СтоимостьВыработкиОтрез;
			КонецЕсли;
		Иначе
			Если НоменклатураПотолок.Потолок_Многфактурный Тогда
				Результат = СтрокаЦены.СтоимостьВыработкиМногофактурныйПотолок;
			Иначе
				Результат = СтрокаЦены.СтоимостьВыработкиПотолок;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции