#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда		
		ИнициализироватьСлужебныеРеквизиты();		
	КонецЕсли;
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Основание") Тогда
			Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство")
				И ДанныеЗаполнения.Свойство("ТолькоМатериалы") Тогда
				ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения.Основание, ДанныеЗаполнения.ТолькоМатериалы);
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПокупателя") Тогда	
		ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ЗаполнитьПоЗаказДоговоруМонтажу(ДанныеЗаполнения);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.Монтаж") Тогда
		ЗаполнитьПоЗаказДоговоруМонтажу(ДанныеЗаполнения);
	
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда		
		ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения);
		
	КонецЕсли;
	
	ПерезаполнитьЯчейки(); //nva
	
	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерезаполнитьЯчейки()
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТЧ.Ячейка = ОбщийМодульДокументы.ПолучитьЯчейку(СтрокаТЧ.Номенклатура, Склад);
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") И НЕ Основание.Пустая() Тогда
		//Всё ок, проверяемые реквизиты комната и назначение оставляем
		
		//#4679
		Если ПолучитьФункциональнуюОпцию("КоличествоТоваровКСписаниюВРозницеНеСоответствуетКоличествуПроданногоТовара") Тогда
			РеквизитКоличество = ПроверяемыеРеквизиты.Найти("Товары.Количество");
			Если НЕ РеквизитКоличество = Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(РеквизитКоличество);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам И ПроверяемыеРеквизиты.Найти("Товары.Комната") <> Неопределено Тогда			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Комната"));
		КонецЕсли;
		
	Иначе
		Если ПроверяемыеРеквизиты.Найти("Товары.Комната") <> Неопределено Тогда			
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Комната"));
		КонецЕсли;
		Если ПроверяемыеРеквизиты.Найти("Товары.Назначение") <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Товары.Назначение"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьЗаполнениеНаОснованииЗаказа(ЭтотОбъект, Отказ, РежимЗаписи);
	
	Документы.ЗаказДоговор.ПроверитьКомнатыПоЗаказу(ЭтотОбъект, Отказ, РежимЗаписи);
	
	// №12269
	Документы.ПоступлениеТоваровИУслуг.ПроверитьКоличествоИПлощадьПотолка(ЭтотОбъект, Отказ, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ЗаказыПоставщикам Приход
	Если НЕ Движения.ЗаказыПоставщикам.ВыполнитьПриход(Ссылка, Организация, Товары) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// регистр ЗаказыРозницыПоставщикам
	Движения.ЗаказыРозницыПоставщикам.Записывать = Истина;
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказДоговор") 
		ИЛИ ТипЗнч(Основание) = Тип("ДокументСсылка.Монтаж") Тогда
		Если НЕ Основание.Пустая() Тогда
			Для Каждого ТекущаяСтрока Из Товары Цикл
				Движение = Движения.ЗаказыРозницыПоставщикам.Добавить();
				Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
				Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
				Движение.Заказан = ТекущаяСтрока.Количество;
				Движение.ЗаказДоговор = Основание;
				Движение.Период = Дата;
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
	// регистр РасчетыСКонтрагентами Расход
	Если СуммаДокумента > 0 тогда
		Движения.РасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.РасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период 	 = Дата;
		Движение.Заказ 		 = Ссылка;
		Движение.Контрагент  = Контрагент;
		Движение.Организация = Организация;
		Движение.Сумма 		 = СуммаДокумента;
	КонецЕсли;
	
	//регистр Обеспечение заказов Розница
	Если РегистрыНакопления.ОбеспечениеЗаказовРозницы.ТребуетсяЗаписьПоОснованию(Основание) Тогда		
		Движения.ОбеспечениеЗаказовРозницы.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из Товары Цикл
			Если (НЕ ЗначениеЗаполнено(ТекущаяСтрока.Комната) И СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам)
				ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Назначение)
				ИЛИ НЕ ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(ТекущаяСтрока.Номенклатура) Тогда 
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.ОбеспечениеЗаказовРозницы.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Заказ 			= Основание;
			Движение.Период 		= Дата;			
			Движение.Номенклатура 	= ТекущаяСтрока.Номенклатура;
			Движение.ХарактеристикаНоменклатуры 	= ТекущаяСтрока.ХарактеристикаНоменклатуры;
			Движение.Комната 		= ТекущаяСтрока.Комната;
			Движение.Назначение 	= ТекущаяСтрока.Назначение;
			Движение.Количество 	= ТекущаяСтрока.Количество;
			Движение.КоличествоПоФакту = ТекущаяСтрока.Количество;
			//#4679
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущаяСтрока.Номенклатура) Тогда 
				Движение.Количество = 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//#16643
	ОбщийМодульСервер.ОжидаемыеПоставки_Рассчитать(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// #16643
	ОбщийМодульСервер.ОжидаемыеПоставки_УдалитьЗаписиПоЗаказу(Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14675
	СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам = Константы.УчетОбеспеченностиРозницыПоКомнатам.Получить();
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаПроизводство(ДанныеЗаполнения, ТолькоМатериалы = Ложь)
	
	Документы.ЗаказНаПроизводство.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения);
	
	ОбщийМодуль.ЗаполнитьШапкуДокумента(ЭтотОбъект);                                    
	
	Валюта 			= ДанныеЗаполнения.Валюта;
	//Комментарий 	= ДанныеЗаполнения.Комментарий; //#5849
	Основание 		= ДанныеЗаполнения.Ссылка;		
	Организация 	= ДанныеЗаполнения.Организация;
	
	Если НЕ ТолькоМатериалы Тогда
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТовары, 
			"Номенклатура, ХарактеристикаНоменклатуры, Количество, Коэффициент, ЕдиницаИзмерения, Цена, Сумма");
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда 
				НоваяСтрока.Потолок = ?(ДанныеЗаполнения.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка, ДанныеЗаполнения.ПродукцияНоменклатура, Справочники.Номенклатура.ПустаяСсылка());
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаУслуги, 
			"Номенклатура, Количество, Коэффициент, ЕдиницаИзмерения, Цена, Сумма");
			Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда 
				НоваяСтрока.Потолок = ?(ДанныеЗаполнения.ВидЗаказа = Перечисления.ВидыЗаказовНаПроизводство.ПроизводствоПотолка, ДанныеЗаполнения.ПродукцияНоменклатура, Справочники.Номенклатура.ПустаяСсылка());
			КонецЕсли;
		КонецЦикла;		
	Иначе
		
		Для Каждого ТекСтрокаОснования Из ДанныеЗаполнения.Материалы Цикл
			// #13705 убрана проверка на Вид номенклатуры
			//Если ТекСтрокаОснования.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Полотно Тогда
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования);
			//КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуПокупателя(ДанныеЗаполнения)
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(ДанныеЗаполнения);
	
	Организация = ДанныеЗаполнения.Организация;
	Валюта 		= ДанныеЗаполнения.Валюта;
	Основание 	= ДанныеЗаполнения;
	Склад 		= ДанныеЗаполнения.Склад;	
	
	Для Каждого ТекСтрокаОснования Из ДанныеЗаполнения.Товары Цикл
		Если НЕ ТекСтрокаОснования.Номенклатура.Пустая() Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования, "Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, Потолок, Комната");
		КонецЕсли;
	КонецЦикла;	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказДоговоруМонтажу(ДанныеЗаполнения)
	
	Организация = ДанныеЗаполнения.Организация;
	Валюта 		= ДанныеЗаполнения.Валюта;
	Основание 	= ДанныеЗаполнения;
	
	ДобавлятьТовары 	= Константы.ЗаказПоставщикуЗаказыватьТовары.Получить();
	ДобавлятьМатериалы  = Константы.ЗаказПоставщикуЗаказыватьМатериалы.Получить();
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	РегистрыНакопления.ОбеспечениеЗаказовРозницы.ПолучитьОстаткиКОбеспечению(МенеджерВТ, ДанныеЗаполнения, Ссылка, СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Товары.Комната КАК Комната,
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Товары.Коэффициент КАК Коэффициент,
	|	ВТ_Товары.Назначение КАК Назначение,
	|	ВТ_Товары.НомерПотолка КАК НомерПотолка,
	|	ВТ_Товары.КоличествоКОбеспечению КАК Количество
	|ИЗ
	|	ВТ_ТоварыКОбеспечениюСвернуто КАК ВТ_Товары
	|ГДЕ
	|	ВТ_Товары.КоличествоКОбеспечению > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Материалы.Комната КАК Комната,
	|	ВТ_Материалы.Номенклатура КАК Номенклатура,
	|	ВТ_Материалы.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Материалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Материалы.Коэффициент КАК Коэффициент,
	|	ВТ_Материалы.Назначение КАК Назначение,
	|	ВТ_Материалы.КоличествоКОбеспечению КАК Количество
	|ИЗ
	|	ВТ_МатериалыКОбеспечениюСвернуто КАК ВТ_Материалы
	|ГДЕ
	|	ВТ_Материалы.КоличествоКОбеспечению > 0";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаТоваров = РезультатЗапроса[0].Выбрать();
	ВыборкаМатериалов = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаТоваров.Следующий() Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ВыборкаТоваров.Номенклатура) Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТоваров);
			//#4679
			Если ПолучитьФункциональнуюОпцию("КоличествоТоваровКСписаниюВРозницеНеСоответствуетКоличествуПроданногоТовара") Тогда
				НоваяСтрока.Количество = НоваяСтрока.Номенклатура.Потолок_КоличествоПродукция;
			КонецЕсли;
		ИначеЕсли ВыборкаТоваров.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Материал и ДобавлятьТовары Тогда
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТоваров);
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") И НЕ ПустаяСтрока(ВыборкаТоваров.НомерПотолка) Тогда
				НоваяСтрока.Потолок = Документы.ЗаказДоговор.ПолучитьПотолокОснованияПоНомеру(ДанныеЗаполнения.ТоварыУслуги, ВыборкаТоваров.НомерПотолка);
			КонецЕсли;		
		Иначе
			Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") И НЕ ПустаяСтрока(ВыборкаТоваров.НомерПотолка) Тогда
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаТоваров);
				НоваяСтрока.Потолок = Документы.ЗаказДоговор.ПолучитьПотолокОснованияПоНомеру(ДанныеЗаполнения.ТоварыУслуги, ВыборкаТоваров.НомерПотолка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ДобавлятьМатериалы Тогда
		Пока ВыборкаМатериалов.Следующий() Цикл
			НоваяСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаМатериалов);
		КонецЦикла;
	КонецЕсли;
	
	СуммаДокумента = Товары.Итог("Сумма");
	
КонецПроцедуры
	
#КонецОбласти

#КонецЕсли