
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
КонецПроцедуры

Функция СформироватьОтчет(ПараметрыФормирования, АдресДляРазмещенияРезультата = Неопределено) Экспорт
	
	//ТаблицаТекущихПоказателей = СтруктураПараметров.ТаблицаПоказателей;
	Дата = ПараметрыФормирования.Дата;
	ЗаголовокВыведен = Ложь;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПрайсЛист";
	
	Если ПараметрыФормирования.ПрайсТоварыМатериалыУслуги Тогда
		СформироватьНаСервереКомплектующие(ТабличныйДокумент, ЗаголовокВыведен, ПараметрыФормирования);
	КонецЕсли;	
	Если ПараметрыФормирования.ПрайсПотолки Тогда
		СформироватьНаСервереПродукция(ТабличныйДокумент, ЗаголовокВыведен, ПараметрыФормирования);
	КонецЕсли;	
	Если ПараметрыФормирования.ПрайсПроизводственныеУслугиНаПотолки Тогда
		СформироватьНаСервереУслугиПроизводства(ТабличныйДокумент, ЗаголовокВыведен, ПараметрыФормирования);
	КонецЕсли;	
	Если ПараметрыФормирования.ПрайсОтрезы Тогда	
		СформироватьНаСервереПродукцияОтрез(ТабличныйДокумент, ЗаголовокВыведен, ПараметрыФормирования);
	КонецЕсли;
	Если ПараметрыФормирования.ПрайсПроизводственныеУслугиНаОтрезы Тогда	
		СформироватьНаСервереУслугиПроизводстваОтрезы(ТабличныйДокумент, ЗаголовокВыведен, ПараметрыФормирования);
	КонецЕсли;

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ТабличныйДокумент", ТабличныйДокумент);
	
	АдресХранения = ПоместитьВоВременноеХранилище(СтруктураВозврата, АдресДляРазмещенияРезультата);
	Возврат СтруктураВозврата;
		
КонецФункции

Процедура СформироватьНаСервереКомплектующие(ТабличныйДокумент, ЗаголовокВыведен, ПараметрыФормирования)
	
	СтруктураПараметров = Новый Структура;	
	
	//СКДНоменклатура = ПолучитьМакет("СКДНоменклатура");
	//СКДФактура 		= ПолучитьМакет("СКДФактура");
	СписокДляОтбораНоменклатуры = ПараметрыФормирования.СписокДляОтбораНоменклатуры; //ПолучитьМассивСсылокПоОтбору(СКДНоменклатура, ПараметрыФормирования.КомпоновщикНастроекНоменклатура, "Номенклатура");
	СписокДляОтбораФактур 		= ПараметрыФормирования.СписокДляОтбораФактур; //ПолучитьМассивСсылокПоОтбору(СКДФактура, ПараметрыФормирования.КомпоновщикНастроекФактура, "Фактура");
	
	Если СписокДляОтбораНоменклатуры.Количество() = 0 Тогда
		СписокДляОтбораНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ДатаОтчета", 					ПараметрыФормирования.Дата);
	СтруктураПараметров.Вставить("СписокВидовЦен", 				ПараметрыФормирования.СписокВидовЦен);
	СтруктураПараметров.Вставить("СписокДляОтбораНоменклатуры",	СписокДляОтбораНоменклатуры);
	СтруктураПараметров.Вставить("СписокДляОтбораФактур", 		СписокДляОтбораФактур);
	СтруктураПараметров.Вставить("Валюта", 						ПараметрыФормирования.Валюта);
	СтруктураПараметров.Вставить("ВыводитьКартинки", 			ПараметрыФормирования.ВыводитьКартинки);
	СтруктураПараметров.Вставить("ПоказыватьНулевыеЦены", 		ПараметрыФормирования.ПоказыватьНулевыеЦены);
	СтруктураПараметров.Вставить("ПоказыватьАрхивныеПозиции", 	ПараметрыФормирования.ПоказыватьАрхивныеПозиции);
	СтруктураПараметров.Вставить("ИндивидуальныеЦены", 			Ложь);
	СтруктураПараметров.Вставить("Контрагент", 					Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДоговорКонтрагента", 			Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
	//ТекОбъект = РеквизитФормыВЗначение("Отчет");
	Макет = ПолучитьМакет("Макет");
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_Комплектующие";
	
	Если НЕ ЗаголовокВыведен Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаПрайса");
		ОбластьМакета.Параметры.Организация = ПараметрыФормирования.Организация;
		ОбластьМакета.Параметры.Дата = Формат(ПараметрыФормирования.Дата,"ДЛФ=ДД");
		Таб.Вывести(ОбластьМакета);
		ЗаголовокВыведен = Истина;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
	ОбластьМакета.Параметры.ЦеныНоменклатуры = "Товары, материалы, услуги";
	Таб.Вывести(ОбластьМакета);
	
	ВывестиКомплектующие(СтруктураПараметров, Макет, Таб);
	ПрисоединитьТабличныйДокумент(ТабличныйДокумент, Таб);
	
	Если ПараметрыФормирования.ВидыИндивидуальныхЦен.Количество() > 0 Тогда 
		Для каждого ВидИндивидуальнойЦены Из ПараметрыФормирования.ВидыИндивидуальныхЦен Цикл
			Если ЗначениеЗаполнено(ВидИндивидуальнойЦены.Контрагент) И ЗначениеЗаполнено(ВидИндивидуальнойЦены.ДоговорКонтрагента) Тогда
				СтруктураПараметров.Контрагент = ВидИндивидуальнойЦены.Контрагент;
				СтруктураПараметров.ДоговорКонтрагента = ВидИндивидуальнойЦены.ДоговорКонтрагента;
				СтруктураПараметров.ИндивидуальныеЦены = Истина;
				
				Таб = Новый ТабличныйДокумент;
				Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_Комплектующие";
	  
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
				ОбластьМакета.Параметры.ЦеныНоменклатуры = "Товары, материалы, услуги ("+ ВидИндивидуальнойЦены.Контрагент+")";
				Таб.Вывести(ОбластьМакета);
				
				ВывестиКомплектующие(СтруктураПараметров, Макет, Таб);
				ПрисоединитьТабличныйДокумент(ТабличныйДокумент, Таб);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНаСервереПродукция(ТабличныйДокумент, ЗаголовокВыведен, ПараметрыФормирования)
	
	СтруктураПараметров = Новый Структура;	
	
	//СКДНоменклатура = ПолучитьМакет("СКДНоменклатура");
	//СКДФактура 		= ПолучитьМакет("СКДФактура");
	СписокДляОтбораНоменклатуры = ПараметрыФормирования.СписокДляОтбораНоменклатуры; //ПолучитьМассивСсылокПоОтбору(СКДНоменклатура, ПараметрыФормирования.КомпоновщикНастроекНоменклатура, "Номенклатура");
	СписокДляОтбораФактур 		= ПараметрыФормирования.СписокДляОтбораФактур; //ПолучитьМассивСсылокПоОтбору(СКДФактура, ПараметрыФормирования.КомпоновщикНастроекФактура, "Фактура");
	
	Если СписокДляОтбораНоменклатуры.Количество() = 0 Тогда
		СписокДляОтбораНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ДатаОтчета", 					ПараметрыФормирования.Дата);
	СтруктураПараметров.Вставить("СписокВидовЦен", 				ПараметрыФормирования.СписокВидовЦен);
	СтруктураПараметров.Вставить("СписокДляОтбораНоменклатуры",	СписокДляОтбораНоменклатуры);
	СтруктураПараметров.Вставить("СписокДляОтбораФактур", 		СписокДляОтбораФактур);
	СтруктураПараметров.Вставить("Валюта", 						ПараметрыФормирования.Валюта);
	СтруктураПараметров.Вставить("ПоказыватьНулевыеЦены", 		ПараметрыФормирования.Потолки_ПоказыватьНулевыеЦены);
	СтруктураПараметров.Вставить("ВидНоменклатурыПотолки",		Справочники.ВидыНоменклатуры.Потолок);
	СтруктураПараметров.Вставить("ПоказыватьАрхивныеПозиции", 	ПараметрыФормирования.Потолки_ПоказыватьАрхивныеПозиции);
	СтруктураПараметров.Вставить("ГруппировкаПоФактуре", 		ПараметрыФормирования.Потолки_ГруппировкаПоФактуре);
	СтруктураПараметров.Вставить("ГруппировкаПоГруппеФактур", 	ПараметрыФормирования.Потолки_ГруппировкаПоГруппеФактур);
	СтруктураПараметров.Вставить("ИндивидуальныеЦены", 			Ложь);
	СтруктураПараметров.Вставить("Контрагент", 					Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДоговорКонтрагента", 			Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
	Макет = ПолучитьМакет("МакетПотолки");
	МакетОсновной = ПолучитьМакет("Макет");
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_Потолки";
	
	Если НЕ ЗаголовокВыведен Тогда
		ОбластьМакета = МакетОсновной.ПолучитьОбласть("ШапкаПрайса");
		ОбластьМакета.Параметры.Организация = ПараметрыФормирования.Организация;
		ОбластьМакета.Параметры.Дата = Формат(ПараметрыФормирования.Дата,"ДЛФ=ДД");
		Таб.Вывести(ОбластьМакета);
		ЗаголовокВыведен=Истина;
	КонецЕсли;
		
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
	ОбластьМакета.Параметры.ЦеныНоменклатуры = "Потолки";
	Таб.Вывести(ОбластьМакета);
	
	ВывестиЦеныНаПродукцию(СтруктураПараметров, Макет, Таб);
	ПрисоединитьТабличныйДокумент(ТабличныйДокумент, Таб);
	
	Если ПараметрыФормирования.ВидыИндивидуальныхЦен.Количество()>0 Тогда 
		Для каждого ВидИндивидуальнойЦены Из ПараметрыФормирования.ВидыИндивидуальныхЦен Цикл
			Если ЗначениеЗаполнено(ВидИндивидуальнойЦены.Контрагент) И ЗначениеЗаполнено(ВидИндивидуальнойЦены.ДоговорКонтрагента) Тогда
				СтруктураПараметров.Контрагент = ВидИндивидуальнойЦены.Контрагент;
				СтруктураПараметров.ДоговорКонтрагента = ВидИндивидуальнойЦены.ДоговорКонтрагента;
				СтруктураПараметров.ИндивидуальныеЦены = Истина;
				
				Таб = Новый ТабличныйДокумент;
				Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_Комплектующие";
	                        				
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
				ОбластьМакета.Параметры.ЦеныНоменклатуры = "Потолки ("+ ВидИндивидуальнойЦены.Контрагент+")";
				Таб.Вывести(ОбластьМакета);
				
				ВывестиЦеныНаПродукцию(СтруктураПараметров, Макет, Таб);
				ПрисоединитьТабличныйДокумент(ТабличныйДокумент, Таб);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНаСервереПродукцияОтрез(ТабличныйДокумент, ЗаголовокВыведен, ПараметрыФормирования)
	
	СтруктураПараметров = Новый Структура;	
	
	//СКДНоменклатура = ПолучитьМакет("СКДНоменклатура");
	//СКДФактура 		= ПолучитьМакет("СКДФактура");
	СписокДляОтбораНоменклатуры = ПараметрыФормирования.СписокДляОтбораНоменклатуры; //ПолучитьМассивСсылокПоОтбору(СКДНоменклатура, ПараметрыФормирования.КомпоновщикНастроекНоменклатура, "Номенклатура");
	СписокДляОтбораФактур 		= ПараметрыФормирования.СписокДляОтбораФактур; //ПолучитьМассивСсылокПоОтбору(СКДФактура, ПараметрыФормирования.КомпоновщикНастроекФактура, "Фактура");
	
	Если СписокДляОтбораНоменклатуры.Количество() = 0 Тогда
		СписокДляОтбораНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ДатаОтчета", 					ПараметрыФормирования.Дата);
	СтруктураПараметров.Вставить("СписокВидовЦен", 				ПараметрыФормирования.СписокВидовЦен);
	СтруктураПараметров.Вставить("СписокДляОтбораНоменклатуры",	СписокДляОтбораНоменклатуры);
	СтруктураПараметров.Вставить("СписокДляОтбораФактур", 		СписокДляОтбораФактур);
	СтруктураПараметров.Вставить("Валюта", 						ПараметрыФормирования.Валюта);
	СтруктураПараметров.Вставить("ПоказыватьНулевыеЦены", 		ПараметрыФормирования.Отрезы_ПоказыватьНулевыеЦены);
	СтруктураПараметров.Вставить("ВидНоменклатурыПотолки",		Справочники.ВидыНоменклатуры.Отрез);
	СтруктураПараметров.Вставить("ПоказыватьАрхивныеПозиции", 	ПараметрыФормирования.Отрезы_ПоказыватьАрхивныеПозиции);
	СтруктураПараметров.Вставить("ГруппировкаПоФактуре", 		ПараметрыФормирования.Отрезы_ГруппировкаПоФактуре);
	СтруктураПараметров.Вставить("ГруппировкаПоГруппеФактур", 	ПараметрыФормирования.Отрезы_ГруппировкаПоГруппеФактур);
	СтруктураПараметров.Вставить("ИндивидуальныеЦены", 			Ложь);
	СтруктураПараметров.Вставить("Контрагент", 					Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДоговорКонтрагента", 			Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
	Макет = ПолучитьМакет("МакетПотолки");
	МакетОсновной = ПолучитьМакет("Макет");
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_Потолки";
	
	Если НЕ ЗаголовокВыведен Тогда
		ОбластьМакета = МакетОсновной.ПолучитьОбласть("ШапкаПрайса");
		ОбластьМакета.Параметры.Организация = ПараметрыФормирования.Организация;
		ОбластьМакета.Параметры.Дата = Формат(ПараметрыФормирования.Дата,"ДЛФ=ДД");
		Таб.Вывести(ОбластьМакета);
		ЗаголовокВыведен=Истина;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
	ОбластьМакета.Параметры.ЦеныНоменклатуры = "Отрезы";
	Таб.Вывести(ОбластьМакета);
	
	ВывестиЦеныНаПродукцию(СтруктураПараметров, Макет, Таб);
	ПрисоединитьТабличныйДокумент(ТабличныйДокумент, Таб);
	
	Если ПараметрыФормирования.ВидыИндивидуальныхЦен.Количество()>0 Тогда 
		Для каждого ВидИндивидуальнойЦены Из ПараметрыФормирования.ВидыИндивидуальныхЦен Цикл
			Если ЗначениеЗаполнено(ВидИндивидуальнойЦены.Контрагент) И ЗначениеЗаполнено(ВидИндивидуальнойЦены.ДоговорКонтрагента) Тогда
				СтруктураПараметров.Контрагент = ВидИндивидуальнойЦены.Контрагент;
				СтруктураПараметров.ДоговорКонтрагента = ВидИндивидуальнойЦены.ДоговорКонтрагента;
				СтруктураПараметров.ИндивидуальныеЦены = Истина;
				
				Таб = Новый ТабличныйДокумент;
				Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_Потолки";
	                        				
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
				ОбластьМакета.Параметры.ЦеныНоменклатуры = "Отрезы ("+ ВидИндивидуальнойЦены.Контрагент+")";
				Таб.Вывести(ОбластьМакета);
				
				ВывестиЦеныНаПродукцию(СтруктураПараметров, Макет, Таб);
				ПрисоединитьТабличныйДокумент(ТабличныйДокумент, Таб);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьНаСервереУслугиПроизводства(ТабличныйДокумент, ЗаголовокВыведен, ПараметрыФормирования)
	
	СтруктураПараметров = Новый Структура;	

	//СКДНоменклатура = ПолучитьМакет("СКДНоменклатура");
	//СКДФактура 		= ПолучитьМакет("СКДФактура");
	СписокДляОтбораНоменклатуры = ПараметрыФормирования.СписокДляОтбораНоменклатуры; //ПолучитьМассивСсылокПоОтбору(СКДНоменклатура, ПараметрыФормирования.КомпоновщикНастроекНоменклатура, "Номенклатура");
	СписокДляОтбораФактур 		= ПараметрыФормирования.СписокДляОтбораФактур; //ПолучитьМассивСсылокПоОтбору(СКДФактура, ПараметрыФормирования.КомпоновщикНастроекФактура, "Фактура");
	
	Если СписокДляОтбораНоменклатуры.Количество() = 0 Тогда
		СписокДляОтбораНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ДатаОтчета", 					ПараметрыФормирования.Дата);
	СтруктураПараметров.Вставить("СписокВидовЦен", 				ПараметрыФормирования.СписокВидовЦен);
	СтруктураПараметров.Вставить("СписокДляОтбораНоменклатуры",	СписокДляОтбораНоменклатуры);
	СтруктураПараметров.Вставить("СписокДляОтбораФактур", 			СписокДляОтбораФактур);
	СтруктураПараметров.Вставить("Валюта", 						ПараметрыФормирования.Валюта);
	СтруктураПараметров.Вставить("ИндивидуальныеЦены", 			Ложь);
	СтруктураПараметров.Вставить("ВидНоменклатурыПотолки",			Справочники.ВидыНоменклатуры.Потолок);
	СтруктураПараметров.Вставить("ПоказыватьАрхивныеПозиции", 		ПараметрыФормирования.ПроизводственныеУслуги_ПоказыватьАрхивныеПозиции);
	СтруктураПараметров.Вставить("Контрагент", 						Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДоговорКонтрагента", 				Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
	Макет = ПолучитьМакет("МакетУслугиРаскроя");	
	МакетОсновной = ПолучитьМакет("Макет");
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_УслугиРаскроя";
	//Таб.НачатьАвтогруппировкуСтрок();
	
	Если НЕ ЗаголовокВыведен Тогда
		ОбластьМакета = МакетОсновной.ПолучитьОбласть("ШапкаПрайса");
		ОбластьМакета.Параметры.Организация = ПараметрыФормирования.Организация;
		ОбластьМакета.Параметры.Дата = Формат(ПараметрыФормирования.Дата,"ДЛФ=ДД");
		Таб.Вывести(ОбластьМакета);
		ЗаголовокВыведен=Истина;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
	ОбластьМакета.Параметры.ЦеныНоменклатуры = "Производственные услуги на потолки";
	Таб.Вывести(ОбластьМакета);
	
	ВывестиУслугиПроизводства(ПараметрыФормирования.Дата, ПараметрыФормирования.СписокВидовЦен, Макет, Таб, СтруктураПараметров);
	ПрисоединитьТабличныйДокумент(ТабличныйДокумент, Таб);
	
	Если ПараметрыФормирования.ВидыИндивидуальныхЦен.Количество()>0 Тогда 
		Для каждого ВидИндивидуальнойЦены Из ПараметрыФормирования.ВидыИндивидуальныхЦен Цикл
			Если ЗначениеЗаполнено(ВидИндивидуальнойЦены.Контрагент) И ЗначениеЗаполнено(ВидИндивидуальнойЦены.ДоговорКонтрагента) Тогда
				СтруктураПараметров.Контрагент = ВидИндивидуальнойЦены.Контрагент;
				СтруктураПараметров.ДоговорКонтрагента = ВидИндивидуальнойЦены.ДоговорКонтрагента;
				СтруктураПараметров.ИндивидуальныеЦены = Истина;
				
				Таб = Новый ТабличныйДокумент;
				Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_УслугиРаскроя";
	                        				
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
				ОбластьМакета.Параметры.ЦеныНоменклатуры = "Производственные услуги на потолки ("+ ВидИндивидуальнойЦены.Контрагент+")";
				Таб.Вывести(ОбластьМакета);
				
				ВывестиУслугиПроизводства(ПараметрыФормирования.Дата, ПараметрыФормирования.СписокВидовЦен, Макет, Таб, СтруктураПараметров);
				ПрисоединитьТабличныйДокумент(ТабличныйДокумент, Таб);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьНаСервереУслугиПроизводстваОтрезы(ТабличныйДокумент, ЗаголовокВыведен, ПараметрыФормирования)
	
	СтруктураПараметров = Новый Структура;	
	
	//СКДНоменклатура = ПолучитьМакет("СКДНоменклатура");
	//СКДФактура 		= ПолучитьМакет("СКДФактура");
	СписокДляОтбораНоменклатуры = ПараметрыФормирования.СписокДляОтбораНоменклатуры; //ПолучитьМассивСсылокПоОтбору(СКДНоменклатура, ПараметрыФормирования.КомпоновщикНастроекНоменклатура, "Номенклатура");
	СписокДляОтбораФактур 		= ПараметрыФормирования.СписокДляОтбораФактур; //ПолучитьМассивСсылокПоОтбору(СКДФактура, ПараметрыФормирования.КомпоновщикНастроекФактура, "Фактура");
	
	Если СписокДляОтбораНоменклатуры.Количество() = 0 Тогда
		СписокДляОтбораНоменклатуры.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ДатаОтчета", 					ПараметрыФормирования.Дата);
	СтруктураПараметров.Вставить("СписокВидовЦен", 				ПараметрыФормирования.СписокВидовЦен);
	СтруктураПараметров.Вставить("СписокДляОтбораНоменклатуры",	СписокДляОтбораНоменклатуры);
	СтруктураПараметров.Вставить("СписокДляОтбораФактур", 		СписокДляОтбораФактур);
	СтруктураПараметров.Вставить("Валюта", 						ПараметрыФормирования.Валюта);
	СтруктураПараметров.Вставить("ВидНоменклатурыПотолки",		Справочники.ВидыНоменклатуры.Отрез);
	СтруктураПараметров.Вставить("ИндивидуальныеЦены", 			Ложь);
	СтруктураПараметров.Вставить("ПоказыватьАрхивныеПозиции", 	ПараметрыФормирования.ПроизводственныеУслугиОтрезы_ПоказыватьАрхивныеПозиции);
	СтруктураПараметров.Вставить("Контрагент", 					Справочники.Контрагенты.ПустаяСсылка());
	СтруктураПараметров.Вставить("ДоговорКонтрагента", 			Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
	Макет = ПолучитьМакет("МакетУслугиРаскроя");	
	МакетОсновной = ПолучитьМакет("Макет");
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_УслугиРаскроя";
	Таб.НачатьАвтогруппировкуСтрок();
	
	Если НЕ ЗаголовокВыведен Тогда
		ОбластьМакета = МакетОсновной.ПолучитьОбласть("ШапкаПрайса");
		ОбластьМакета.Параметры.Организация = ПараметрыФормирования.Организация;
		ОбластьМакета.Параметры.Дата = Формат(ПараметрыФормирования.Дата,"ДЛФ=ДД");
		Таб.Вывести(ОбластьМакета);
		ЗаголовокВыведен=Истина;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
	ОбластьМакета.Параметры.ЦеныНоменклатуры = "Производственные услуги на отрезы";
	Таб.Вывести(ОбластьМакета);
	
	ВывестиУслугиПроизводства(ПараметрыФормирования.Дата, ПараметрыФормирования.СписокВидовЦен, Макет, Таб, СтруктураПараметров);
	ПрисоединитьТабличныйДокумент(ТабличныйДокумент, Таб);
	
	Если ПараметрыФормирования.ВидыИндивидуальныхЦен.Количество()>0 Тогда 
		Для каждого ВидИндивидуальнойЦены Из ПараметрыФормирования.ВидыИндивидуальныхЦен Цикл
			Если ЗначениеЗаполнено(ВидИндивидуальнойЦены.Контрагент) И ЗначениеЗаполнено(ВидИндивидуальнойЦены.ДоговорКонтрагента) Тогда
				СтруктураПараметров.Контрагент = ВидИндивидуальнойЦены.Контрагент;
				СтруктураПараметров.ДоговорКонтрагента = ВидИндивидуальнойЦены.ДоговорКонтрагента;
				СтруктураПараметров.ИндивидуальныеЦены = Истина;
				
				Таб = Новый ТабличныйДокумент;
				Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист_УслугиРаскроя";
	                        				
				ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
				ОбластьМакета.Параметры.ЦеныНоменклатуры = "Производственные услуги на отрезы ("+ ВидИндивидуальнойЦены.Контрагент+")";
				Таб.Вывести(ОбластьМакета);
				
				ВывестиУслугиПроизводства(ПараметрыФормирования.Дата, ПараметрыФормирования.СписокВидовЦен, Макет, Таб, СтруктураПараметров);
				ПрисоединитьТабличныйДокумент(ТабличныйДокумент, Таб);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиКомплектующие(СтруктураПараметров, Макет, Таб)
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	//ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
	//Таб.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	Таб.Вывести(ОбластьМакета);
	
	Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество()-1 Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Цена");
		ОбластьМакета.Параметры.ВидЦен = ?(СтруктураПараметров.ИндивидуальныеЦены, "Индивидуальная", СтруктураПараметров.СписокВидовЦен.Получить(НомерЦены).Значение);
		ОбластьМакета.Параметры.Валюта = СтруктураПараметров.Валюта;
		Таб.Присоединить(ОбластьМакета);
	КонецЦикла;
	
	Если СтруктураПараметров.ВыводитьКартинки Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы|Фото");
		Таб.Присоединить(ОбластьМакета);
	КонецЕсли;
		
	Запрос = Новый Запрос;	
	Запрос.УстановитьПараметр("Период", 				КонецДня(СтруктураПараметров.ДатаОтчета));
	Запрос.УстановитьПараметр("ВидЦены", 				СтруктураПараметров.СписокВидовЦен);
	Запрос.УстановитьПараметр("Номенклатура", 			СтруктураПараметров.СписокДляОтбораНоменклатуры);
	Запрос.УстановитьПараметр("Валюта", 				СтруктураПараметров.Валюта);
	Запрос.УстановитьПараметр("НеПоказыватьНулевыеЦены", НЕ СтруктураПараметров.ПоказыватьНулевыеЦены);
	Запрос.УстановитьПараметр("НеПоказыватьАрхивныеПозиции", НЕ СтруктураПараметров.ПоказыватьАрхивныеПозиции);
	
	Запрос.УстановитьПараметр("ИспользоватьИндивидуальныеЦены",	СтруктураПараметров.ИндивидуальныеЦены);
	Запрос.УстановитьПараметр("Контрагент",				СтруктураПараметров.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",		СтруктураПараметров.ДоговорКонтрагента);
	
	Запрос.Текст =	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	|			ТОГДА ЦеныНоменклатурыИндивидуальныеСрезПоследних.Цена
	|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена,
	|	ЦеныНоменклатурыИндивидуальныеСрезПоследних.Отменена КАК Отменена
	|ПОМЕСТИТЬ ВТ_ИндивидуальныеЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыИндивидуальные.СрезПоследних(
	|			&Период,
	|			Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента
	|				И Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|				И Валюта = &Валюта) КАК ЦеныНоменклатурыИндивидуальныеСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&Период,
	|				Номенклатура В ИЕРАРХИИ (&Номенклатура)
	|					И Валюта = &Валюта) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ЦеныНоменклатурыИндивидуальныеСрезПоследних.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ЕдиницаИзмерения = ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения
	|			И ЦеныНоменклатурыИндивидуальныеСрезПоследних.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЦен.Ссылка КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ХарактеристикаНоменклатуры, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	|	КОНЕЦ КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО)
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ЕдиницаИзмерения, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Валюта, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Цена, 0)
	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ВТ_ЦеныВрем
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Валюта = &Валюта) КАК ЦеныСрезПоследних
	|		ПО (ЦеныСрезПоследних.ВидЦены = ВидыЦен.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Валюта = &Валюта) КАК ЦеныСсылочныхСрезПоследних
	|		ПО (ЦеныСсылочныхСрезПоследних.ВидЦены = ВидыЦен.ВидЦеныНоменклатуры)
	|ГДЕ
	|	ВидыЦен.Ссылка В(&ВидЦены)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ЦеныВрем.Номенклатура КАК Номенклатура,
	|	ВТ_ЦеныВрем.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ЦеныВрем.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_ЦеныВрем.ВидЦены КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ИндивидуальныеЦены.Цена ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА НЕ ВТ_ИндивидуальныеЦены.Отменена
	|						ТОГДА ВТ_ИндивидуальныеЦены.Цена
	|					ИНАЧЕ ВТ_ЦеныВрем.Цена
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ЦеныВрем.Цена
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	ВТ_ЦеныВрем КАК ВТ_ЦеныВрем
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальныеЦены КАК ВТ_ИндивидуальныеЦены
	|		ПО (&ИспользоватьИндивидуальныеЦены)
	|			И ВТ_ЦеныВрем.Валюта = ВТ_ИндивидуальныеЦены.Валюта
	|			И ВТ_ЦеныВрем.ЕдиницаИзмерения = ВТ_ИндивидуальныеЦены.ЕдиницаИзмерения
	|			И ВТ_ЦеныВрем.Номенклатура = ВТ_ИндивидуальныеЦены.Номенклатура
	|			И ВТ_ЦеныВрем.ХарактеристикаНоменклатуры = ВТ_ИндивидуальныеЦены.ХарактеристикаНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ИндивидуальныеЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ЦеныВрем
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(СправочникХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ХарактеристикаНоменклатуры,
	|	ЕСТЬNULL(ВТ_Цены.ЕдиницаИзмерения, СправочникНоменклатура.БазоваяЕдиницаИзмерения) КАК ЕдИзм,
	|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена,
	|	ВТ_Цены.ВидЦены КАК ВидЦены,
	|	ЕСТЬNULL(НоменклатураПрисоединенныеФайлы.ФайлХранилище, НЕОПРЕДЕЛЕНО) КАК ФайлХранилище
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СправочникХарактеристикиНоменклатуры
	|		ПО (СправочникХарактеристикиНоменклатуры.Владелец = СправочникНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО СправочникНоменклатура.Ссылка = ВТ_Цены.Номенклатура
	|			И (ЕСТЬNULL(СправочникХарактеристикиНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) = ВТ_Цены.ХарактеристикаНоменклатуры)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
	|		ПО (НоменклатураПрисоединенныеФайлы.ВладелецФайла = СправочникНоменклатура.Ссылка)
	|			И (НоменклатураПрисоединенныеФайлы.Ссылка = СправочникНоменклатура.ФайлКартинки)
	|ГДЕ
	|	СправочникНоменклатура.Ссылка В ИЕРАРХИИ(&Номенклатура)
	|	И НЕ СправочникНоменклатура.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА &НеПоказыватьНулевыеЦены
	|				ТОГДА ЕСТЬNULL(ВТ_Цены.Цена, 0) <> 0
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	//++#15866 
	|	И ВЫБОР
	|			КОГДА &НеПоказыватьАрхивныеПозиции
	|				ТОГДА НЕ СправочникНоменклатура.Архивная
	|                     И (ЕСТЬNULL(СправочникХарактеристикиНоменклатуры.Ссылка, 0) = 0 ИЛИ НЕ СправочникХарактеристикиНоменклатуры.Архивная)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	//--#15866
	|
	|УПОРЯДОЧИТЬ ПО
	|	СправочникНоменклатура.ЭтоГруппа УБЫВ,
	|	Номенклатура
	|ИТОГИ ПО
	|	Номенклатура ИЕРАРХИЯ,
	|	ЕдИзм,
	|	ХарактеристикаНоменклатуры
	|АВТОУПОРЯДОЧИВАНИЕ";
		
	ВыборкаНоменклатуры = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ИмяОбластиСтрокиДанные = ?(СтруктураПараметров.ВыводитьКартинки, "СтрокаСФото", "Строка") + "|Данные";
	ИмяОбластиСтрокиЦена   = ?(СтруктураПараметров.ВыводитьКартинки, "СтрокаСФото", "Строка") + "|Цена";
	 
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		УровеньДанных = ВыборкаНоменклатуры.Уровень();
		ИмяГруппировкиНоменклатура = "Номенклатура"+УровеньДанных;
		
		// вывод групп номенклатуры
		//Если ВыборкаНоменклатуры.Номенклатура.ЭтоГруппа Тогда
		Если ВыборкаНоменклатуры.ТипЗаписи() = ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Группа|Данные");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаНоменклатуры);
			Таб.Вывести(ОбластьМакета,УровеньДанных,ИмяГруппировкиНоменклатура,Истина);
			ОбластьЯчеек = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 1);
			//ОбластьЯчеек.Отступ = 2 * УровеньДанных; //nva
			
			Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество()-1 Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Группа|Цена");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаНоменклатуры);
				Таб.Присоединить(ОбластьМакета,УровеньДанных,ИмяГруппировкиНоменклатура,Истина);
			КонецЦикла;
					
			Если СтруктураПараметров.ВыводитьКартинки Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Группа|Фото");
				Таб.Присоединить(ОбластьМакета,УровеньДанных,ИмяГруппировкиНоменклатура,Истина);
			КонецЕсли;
			
			ОбластьОбъединения = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 2 + СтруктураПараметров.СписокВидовЦен.Количество() + ?(СтруктураПараметров.ВыводитьКартинки, 1, 0));
			ОбластьОбъединения.Объединить();
			
		// вывод самой номенклатуры
		Иначе
			ВыборкаЕдиницИзмерения = ВыборкаНоменклатуры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаЕдиницИзмерения.Следующий() Цикл				
				ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбластиСтрокиДанные);
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаЕдиницИзмерения);
				Таб.Вывести(ОбластьМакета,УровеньДанных,ИмяГруппировкиНоменклатура,Истина);
				ОбластьЯчеек = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 1);
				//ОбластьЯчеек.Отступ = 2* УровеньДанных; //nva
				
				ВыборкаХарактеристик = ВыборкаЕдиницИзмерения.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					ЭтоПервый = Истина;
					Пока ВыборкаХарактеристик.Следующий() Цикл
						
						Если ВыборкаХарактеристик.ХарактеристикаНоменклатуры.Пустая() Тогда
							
								// характеристики не используются
								Цены = Новый Соответствие;
								ВыборкаЦен = ВыборкаХарактеристик.Выбрать();
								Пока ВыборкаЦен.Следующий() Цикл
									Цены.Вставить(ВыборкаЦен.ВидЦены, ВыборкаЦен.Цена);
								КонецЦикла;
								
								Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество() - 1 Цикл
									ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбластиСтрокиЦена);
									ОбластьМакета.Параметры.Цена = Цены.Получить(СтруктураПараметров.СписокВидовЦен.Получить(НомерЦены).Значение);
									Таб.Присоединить(ОбластьМакета,УровеньДанных,ИмяГруппировкиНоменклатура,Истина);
								КонецЦикла;
								Если СтруктураПараметров.ВыводитьКартинки Тогда
									ОбластьМакетаФото = Макет.ПолучитьОбласть("СтрокаСФото|Фото");
									Если ЗначениеЗаполнено(ВыборкаЕдиницИзмерения.Номенклатура.ФайлКартинки) Тогда
										ЗначениеХранилища = ВыборкаЕдиницИзмерения.Номенклатура.ФайлКартинки.ФайлХранилище.Получить();
									Иначе
										ЗначениеХранилища = Неопределено;
									КонецЕсли;
									Картинка = Новый Картинка(ЗначениеХранилища);
									ОбластьМакетаФото.Рисунки.ФотоТовара.Картинка = Картинка;									
									Таб.Присоединить(ОбластьМакетаФото,УровеньДанных,ИмяГруппировкиНоменклатура,Истина);
								КонецЕсли;
								
						Иначе
							Если ЭтоПервый Тогда
								Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество()-1 Цикл
									ОбластьМакета = Макет.ПолучитьОбласть(ИмяОбластиСтрокиЦена);
									Таб.Присоединить(ОбластьМакета,УровеньДанных,ИмяГруппировкиНоменклатура,Истина);
								КонецЦикла;	
								Если СтруктураПараметров.ВыводитьКартинки Тогда
									ОбластьМакетаФото = Макет.ПолучитьОбласть("СтрокаСФото|Фото");
									Если ЗначениеЗаполнено(ВыборкаЕдиницИзмерения.Номенклатура.ФайлКартинки) Тогда
										ЗначениеХранилища = ВыборкаЕдиницИзмерения.Номенклатура.ФайлКартинки.ФайлХранилище.Получить();
									Иначе
										ЗначениеХранилища = Неопределено;
									КонецЕсли;
									Картинка = Новый Картинка(ЗначениеХранилища);								 
									ОбластьМакетаФото.Рисунки.ФотоТовара.Картинка = Картинка;									
									Таб.Присоединить(ОбластьМакетаФото,УровеньДанных,ИмяГруппировкиНоменклатура,Истина);
								КонецЕсли;
								ЭтоПервый = Ложь;
							КонецЕсли;
							
							Цены = Новый Соответствие;
							ВыборкаЦен = ВыборкаХарактеристик.Выбрать();
							Пока ВыборкаЦен.Следующий() Цикл
								Цены.Вставить(ВыборкаЦен.ВидЦены, ВыборкаЦен.Цена);
							КонецЦикла;
							
							ОбластьМакета = Макет.ПолучитьОбласть("Характеристика|Данные");
							ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаХарактеристик);
							Таб.Вывести(ОбластьМакета,УровеньДанных+1,"Характеристика"+УровеньДанных+1,Истина);
							ОбластьЯчеек = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 1);
							//ОбластьЯчеек.Отступ = 2* УровеньДанных + 2; //nva
							
							Для НомерЦены = 0 По СтруктураПараметров.СписокВидовЦен.Количество() - 1 Цикл
								ОбластьМакета = Макет.ПолучитьОбласть("Характеристика|Цена");
								ОбластьМакета.Параметры.Цена = Цены.Получить(СтруктураПараметров.СписокВидовЦен.Получить(НомерЦены).Значение);										
								Таб.Присоединить(ОбластьМакета,УровеньДанных+1,"Характеристика"+(УровеньДанных+1),Истина);
							КонецЦикла;
							Если СтруктураПараметров.ВыводитьКартинки Тогда								
								ОбластьМакетаФото = Макет.ПолучитьОбласть("Характеристика|Фото");
								Таб.Присоединить(ОбластьМакетаФото,УровеньДанных+1,"Характеристика"+(УровеньДанных+1),Истина);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
										
								
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

Процедура ВывестиЦеныНаПродукцию(СтруктураПараметров, Макет, Таб)
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	СписокВидовЦенМатериалов = Новый СписокЗначений;
	СписокВидовЦенМатериалов.ЗагрузитьЗначения(СтруктураПараметров.СписокВидовЦен.ВыгрузитьЗначения());
	
	//ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокВидаПрайса");
	//Таб.Вывести(ОбластьМакета);
	
	Если СтруктураПараметров.ГруппировкаПоГруппеФактур И СтруктураПараметров.ГруппировкаПоФактуре  Тогда
		ВидШапкиТаблицы = "ШапкаТаблицы";
		ВыводитьЦветКолонкой = Ложь;
	КонецЕсли;
	Если НЕ СтруктураПараметров.ГруппировкаПоГруппеФактур И СтруктураПараметров.ГруппировкаПоФактуре  Тогда
		ВидШапкиТаблицы = "ШапкаТаблицыБезГруппыФактур";
		ВыводитьЦветКолонкой = Ложь;
	КонецЕсли;
	Если СтруктураПараметров.ГруппировкаПоГруппеФактур И НЕ СтруктураПараметров.ГруппировкаПоФактуре  Тогда
		ВидШапкиТаблицы = "ШапкаТаблицыБезФактуры";
		ВыводитьЦветКолонкой = Истина;
	КонецЕсли;
	Если НЕ СтруктураПараметров.ГруппировкаПоГруппеФактур И НЕ СтруктураПараметров.ГруппировкаПоФактуре  Тогда
		ВидШапкиТаблицы = "ШапкаТаблицыБезГруппировок";
		ВыводитьЦветКолонкой = Истина;
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть(ВидШапкиТаблицы+"|Данные");
	Таб.Вывести(ОбластьМакета);
	Если ВыводитьЦветКолонкой Тогда
		ОбластьМакета = Макет.ПолучитьОбласть(ВидШапкиТаблицы+"|Цвет");
		Таб.Присоединить(ОбластьМакета);
	КонецЕсли;
	
	Для НомерЦены = 0 По СписокВидовЦенМатериалов.Количество()-1 Цикл
		ОбластьМакета = Макет.ПолучитьОбласть(ВидШапкиТаблицы + "|Цена");
		ОбластьМакета.Параметры.ВидЦены = ?(СтруктураПараметров.ИндивидуальныеЦены, "Индивидуальная", СписокВидовЦенМатериалов.Получить(НомерЦены).Значение);
		ОбластьМакета.Параметры.Валюта = СтруктураПараметров.Валюта;
		Таб.Присоединить(ОбластьМакета);
	КонецЦикла;
	
	//ОбластьОбъединения = Таб.Область(Таб.ВысотаТаблицы-2, 1, Таб.ВысотаТаблицы-2, 2 + 2*СтруктураПараметров.СписокВидовЦен.Количество());
	//ОбластьОбъединения.Объединить();

	Запрос = Новый Запрос;
	Запрос.Текст =	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              	|	ЦеныИндивидуальныеСрезПоследних.Фактура КАК Фактура,
	              	|	ЦеныИндивидуальныеСрезПоследних.ЦветФактуры КАК ЦветФактуры,
	              	|	ЦеныИндивидуальныеСрезПоследних.ВидНоменклатуры КАК ВидНоменклатуры,
	              	|	ВЫБОР
	              	|		КОГДА ЦеныИндивидуальныеСрезПоследних.ВидЦены = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	              	|			ТОГДА ЦеныИндивидуальныеСрезПоследних.Цена
	              	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)
	              	|	КОНЕЦ КАК Цена,
	              	|	ВЫБОР
	              	|		КОГДА ЦеныИндивидуальныеСрезПоследних.ВидЦеныСФотопечатью = ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)
	              	|			ТОГДА ЦеныИндивидуальныеСрезПоследних.ЦенаСФотопечатью
	              	|		ИНАЧЕ ЕСТЬNULL(ЦеныСФотопечатьюСрезПоследних.Цена, 0)
	              	|	КОНЕЦ КАК ЦенаСФотопечатью,
	              	|	ЦеныИндивидуальныеСрезПоследних.Отменена КАК Отменена
	              	|ПОМЕСТИТЬ ВТ_ИндивидуальныеЦены
	              	|ИЗ
	              	|	РегистрСведений.ЦеныМатериаловИндивидуальные.СрезПоследних(
	              	|			&Период,
	              	|			Контрагент В (&Контрагент)
	              	|				И ДоговорКонтрагента В (&ДоговорКонтрагента)
	              	|				И ВидНоменклатуры = &ВидНоменклатуры
	              	|				И Валюта = &Валюта) КАК ЦеныИндивидуальныеСрезПоследних
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
	              	|				&Период,
	              	|				ВидНоменклатуры = &ВидНоменклатуры
	              	|					И Валюта = &Валюта) КАК ЦеныСрезПоследних
	              	|		ПО ЦеныИндивидуальныеСрезПоследних.Фактура = ЦеныСрезПоследних.Фактура
	              	|			И ЦеныИндивидуальныеСрезПоследних.ЦветФактуры = ЦеныСрезПоследних.ЦветФактуры
	              	|			И ЦеныИндивидуальныеСрезПоследних.ВидЦены = ЦеныСрезПоследних.ВидЦен
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
	              	|				&Период,
	              	|				ВидНоменклатуры = &ВидНоменклатуры
	              	|					И Валюта = &Валюта) КАК ЦеныСФотопечатьюСрезПоследних
	              	|		ПО (ЦеныИндивидуальныеСрезПоследних.Фактура = ЦеныСрезПоследних.Фактура)
	              	|			И (ЦеныИндивидуальныеСрезПоследних.ЦветФактуры = ЦеныСрезПоследних.ЦветФактуры)
	              	|			И (ЦеныИндивидуальныеСрезПоследних.ВидЦеныСФотопечатью = ЦеныСрезПоследних.ВидЦен)
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              	|	ВидыЦен.Ссылка КАК ВидЦены,
	              	|	ВЫБОР
	              	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	              	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Фактура, ЗНАЧЕНИЕ(Справочник.Фактура.ПустаяСсылка))
	              	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Фактура, ЗНАЧЕНИЕ(Справочник.Фактура.ПустаяСсылка))
	              	|	КОНЕЦ КАК Фактура,
	              	|	ВЫБОР
	              	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	              	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ЦветФактуры, ЗНАЧЕНИЕ(Справочник.ЦветФактуры.ПустаяСсылка))
	              	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ЦветФактуры, ЗНАЧЕНИЕ(Справочник.ЦветФактуры.ПустаяСсылка))
	              	|	КОНЕЦ КАК ЦветФактуры,
	              	|	ВЫБОР
	              	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	              	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка))
	              	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка))
	              	|	КОНЕЦ КАК ВидНоменклатуры,
	              	|	ВЫБОР
	              	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	              	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.Цена, 0)
	              	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0)
	              	|	КОНЕЦ КАК Цена,
	              	|	ВЫБОР
	              	|		КОГДА ВидыЦен.СсылочныйВидЦены = ИСТИНА
	              	|			ТОГДА ЕСТЬNULL(ЦеныСсылочныхСрезПоследних.ЦенаСФотопечатью, 0)
	              	|		ИНАЧЕ ЕСТЬNULL(ЦеныСрезПоследних.ЦенаСФотопечатью, 0)
	              	|	КОНЕЦ КАК ЦенаСФотопечатью
	              	|ПОМЕСТИТЬ ВТ_Цены
	              	|ИЗ
	              	|	Справочник.ВидыЦен КАК ВидыЦен
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
	              	|				&Период,
	              	|				ВидНоменклатуры = &ВидНоменклатуры
	              	|					И Валюта = &Валюта) КАК ЦеныСрезПоследних
	              	|		ПО (ЦеныСрезПоследних.ВидЦен = ВидыЦен.Ссылка)
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныМатериалов.СрезПоследних(
	              	|				&Период,
	              	|				ВидНоменклатуры = &ВидНоменклатуры
	              	|					И Валюта = &Валюта) КАК ЦеныСсылочныхСрезПоследних
	              	|		ПО (ЦеныСсылочныхСрезПоследних.ВидЦен = ВидыЦен.ВидЦеныНоменклатуры)
	              	|ГДЕ
	              	|	ВидыЦен.Ссылка В(&ВидЦены)
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              	|	ЦветаФактур.Владелец.Родитель КАК ГруппаФактуры,
	              	|	ЦветаФактур.Владелец КАК Фактура,
	              	|	ЦветаФактур.Ссылка КАК ЦветФактуры,
	              	|	ЕСТЬNULL(ВТ_Цены.ВидНоменклатуры, ЗНАЧЕНИЕ(Справочник.ВидыНоменклатуры.ПустаяСсылка)) КАК ВидНоменклатурыПотолка,
	              	|	ВЫБОР
	              	|		КОГДА НЕ ВТ_ИндивидуальныеЦены.Цена ЕСТЬ NULL
	              	|			ТОГДА ВЫБОР
	              	|					КОГДА НЕ ВТ_ИндивидуальныеЦены.Отменена
	              	|						ТОГДА ВТ_ИндивидуальныеЦены.Цена
	              	|					ИНАЧЕ ЕСТЬNULL(ВТ_Цены.Цена, 0)
	              	|				КОНЕЦ
	              	|		ИНАЧЕ ЕСТЬNULL(ВТ_Цены.Цена, 0)
	              	|	КОНЕЦ КАК Цена,
	              	|	ВЫБОР
	              	|		КОГДА НЕ ВТ_ИндивидуальныеЦены.ЦенаСФотопечатью ЕСТЬ NULL
	              	|			ТОГДА ВЫБОР
	              	|					КОГДА НЕ ВТ_ИндивидуальныеЦены.Отменена
	              	|						ТОГДА ВТ_ИндивидуальныеЦены.ЦенаСФотопечатью
	              	|					ИНАЧЕ ЕСТЬNULL(ВТ_Цены.ЦенаСФотопечатью, 0)
	              	|				КОНЕЦ
	              	|		ИНАЧЕ ЕСТЬNULL(ВТ_Цены.ЦенаСФотопечатью, 0)
	              	|	КОНЕЦ КАК ЦенаСФотопечатью,
	              	|	ВТ_Цены.ВидЦены КАК ВидЦены
	              	|ПОМЕСТИТЬ ВТ
	              	|ИЗ
	              	|	Справочник.ЦветФактуры КАК ЦветаФактур
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	              	|		ПО ЦветаФактур.Владелец = ВТ_Цены.Фактура
	              	|			И ЦветаФактур.Ссылка = ВТ_Цены.ЦветФактуры
	              	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальныеЦены КАК ВТ_ИндивидуальныеЦены
	              	|		ПО (&ИспользоватьИндивидуальныеЦены)
	              	|			И ЦветаФактур.Владелец = ВТ_ИндивидуальныеЦены.Фактура
	              	|			И ЦветаФактур.Ссылка = ВТ_ИндивидуальныеЦены.ЦветФактуры
	              	|ГДЕ
	              	|	ВЫБОР
	              	|			КОГДА &ОтборПоФактуре
	              	|				ТОГДА ЦветаФактур.Владелец В ИЕРАРХИИ (&Фактура)
	              	|			ИНАЧЕ ИСТИНА
	              	|		КОНЕЦ
	              	|;
	              	|
	              	|////////////////////////////////////////////////////////////////////////////////
	              	|ВЫБРАТЬ
	              	|	ВТ.ГруппаФактуры КАК ГруппаФактуры,
	              	|	ВТ.Фактура КАК Фактура,
	              	|	ВТ.ЦветФактуры КАК ЦветФактуры,
	              	|	ВТ.ВидНоменклатурыПотолка КАК ВидНоменклатурыПотолка,
	              	|	ВТ.Цена КАК Цена,
	              	|	ВТ.ЦенаСФотопечатью КАК ЦенаСФотопечатью,
	              	|	ВТ.ВидЦены КАК ВидЦены
	              	|ИЗ
	              	|	ВТ КАК ВТ
	              	|ГДЕ
	              	|	ВЫБОР
	              	|			КОГДА &НеПоказыватьНулевыеЦены
	              	|				ТОГДА ВТ.Цена <> 0
	              	|						ИЛИ ВТ.ЦенаСФотопечатью <> 0
	              	|			ИНАЧЕ ИСТИНА
	              	|		КОНЕЦ
	              	|
	              	|УПОРЯДОЧИТЬ ПО
	              	|	ВТ.ВидНоменклатурыПотолка,
	              	|	ВТ.Фактура,
	              	|	ВТ.ЦветФактуры
	              	|ИТОГИ ПО
	              	|	ВидНоменклатурыПотолка,
	              	|	ГруппаФактуры,
	              	|	Фактура,
	              	|	ЦветФактуры
	              	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	
	
	Запрос.УстановитьПараметр("Период", 					СтруктураПараметров.ДатаОтчета);
	Запрос.УстановитьПараметр("ВидЦены",					СтруктураПараметров.СписокВидовЦен);
	Запрос.УстановитьПараметр("ОтборПоФактуре",				СтруктураПараметров.СписокДляОтбораФактур.Количество() > 0);
	Запрос.УстановитьПараметр("Фактура",					СтруктураПараметров.СписокДляОтбораФактур);
	Запрос.УстановитьПараметр("Валюта", 					СтруктураПараметров.Валюта);
	Запрос.УстановитьПараметр("ВидНоменклатуры",			СтруктураПараметров.ВидНоменклатурыПотолки);
	Запрос.УстановитьПараметр("НеПоказыватьНулевыеЦены", 	НЕ СтруктураПараметров.ПоказыватьНулевыеЦены);
	//++17158
	Запрос.УстановитьПараметр("ИспользоватьИндивидуальныеЦены",	СтруктураПараметров.ИндивидуальныеЦены);
	Запрос.УстановитьПараметр("Контрагент",						СтруктураПараметров.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",				СтруктураПараметров.ДоговорКонтрагента);
	//--17158
	ВыборкаВидов = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидов.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ВидПотолка|Данные");
		ОбластьМакета.Параметры.Заполнить(ВыборкаВидов);
		Таб.Вывести(ОбластьМакета, 1);
		
		Если ВыводитьЦветКолонкой Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ВидПотолка|Цвет");
			ОбластьМакета.Параметры.Заполнить(ВыборкаВидов);
			Таб.Присоединить(ОбластьМакета, 1);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ВидПотолка|Цена");
		Для НомерЦены = 0 По СписокВидовЦенМатериалов.Количество()-1 Цикл
			ОбластьМакета.Параметры.Заполнить(ВыборкаВидов);
			Таб.Присоединить(ОбластьМакета, 1);
		КонецЦикла;
		ОбластьОбъединения = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 2 + 2*СписокВидовЦенМатериалов.Количество());
		ОбластьОбъединения.Объединить(); 
		
		// Группа фактуры
		ВыборкаГруппФактур = ВыборкаВидов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаГруппФактур.Следующий() Цикл
			
			Если СтруктураПараметров.ГруппировкаПоГруппеФактур Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаГруппаФактуры|Данные");
				ОбластьМакета.Параметры.Заполнить(ВыборкаГруппФактур);
				Таб.Вывести(ОбластьМакета, 2);
				
				Если ВыводитьЦветКолонкой Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаГруппаФактуры|Цвет");
					ОбластьМакета.Параметры.Заполнить(ВыборкаГруппФактур);
					Таб.Присоединить(ОбластьМакета, 2);
				КонецЕсли;
				
				ОбластьМакета = Макет.ПолучитьОбласть("СтрокаГруппаФактуры|Цена");
				Для НомерЦены = 0 По СписокВидовЦенМатериалов.Количество()-1 Цикл
					Таб.Присоединить(ОбластьМакета, 2);
				КонецЦикла;
						
				ОбластьОбъединения = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 2 + 2*СписокВидовЦенМатериалов.Количество());
				ОбластьОбъединения.Объединить();
			КонецЕсли;
			
			// Фактура
			ВыборкаФактур = ВыборкаГруппФактур.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаФактур.Следующий() Цикл
				
				Если СтруктураПараметров.ГруппировкаПоФактуре Тогда
					Фактура = ВыборкаФактур.Фактура;
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаФактура|Данные");
					ОбластьМакета.Параметры.Заполнить(ВыборкаФактур);
					Таб.Вывести(ОбластьМакета, 3);
					
					Если ВыводитьЦветКолонкой Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаФактура|Цвет");
						ОбластьМакета.Параметры.Заполнить(ВыборкаФактур);
						Таб.Присоединить(ОбластьМакета, 3);
					КонецЕсли;
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаФактура|Цена");
					Для НомерЦены = 0 По СписокВидовЦенМатериалов.Количество()-1 Цикл
						Таб.Присоединить(ОбластьМакета, 3);
					КонецЦикла;
					ОбластьОбъединения = Таб.Область(Таб.ВысотаТаблицы, 1, Таб.ВысотаТаблицы, 2 + 2*СписокВидовЦенМатериалов.Количество());
					ОбластьОбъединения.Объединить();
				КонецЕсли;
				
				ВыборкаЦветов = ВыборкаФактур.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЦветов.Следующий() Цикл
					
					ЦветФактурыПредставление = ВыборкаЦветов.ЦветФактуры;
					
					//Если СтруктураПараметров.ГруппировкаПоФактуре Тогда
					//	ЦветФактурыПредставление = ВыборкаЦветов.ЦветФактуры;
					//Иначе
					//	ЦветФактурыПредставление = Строка(ВыборкаЦветов.ЦветФактуры) + ", "+ВыборкаФактур.Фактура;
					//КонецЕсли;
					
					ЦеныНоменклатуры = Новый Соответствие;
					ЦеныСФотоНоменклатуры = Новый Соответствие;
					ВыборкаЦены = ВыборкаЦветов.Выбрать();
					Пока ВыборкаЦены.Следующий() Цикл
						ЦеныНоменклатуры.Вставить(ВыборкаЦены.ВидЦены, ВыборкаЦены.Цена);
						ЦеныСФотоНоменклатуры.Вставить(ВыборкаЦены.ВидЦены, ВыборкаЦены.ЦенаСФотопечатью);
					КонецЦикла;
					
					Если ВыводитьЦветКолонкой Тогда
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаФактураЦвет|Данные");
						//ОбластьМакета.Параметры.ЦветФактурыПредставление = ЦветФактурыПредставление;
						ОбластьМакета.Параметры.Заполнить(ВыборкаФактур);
						//ОбластьМакета.Параметры.ЦветФактуры = ВыборкаЦветов.ЦветФактуры;
						Таб.Вывести(ОбластьМакета, 4);	
						ОбластьМакета = Макет.ПолучитьОбласть("СтрокаФактураЦвет|Цвет");
						ОбластьМакета.Параметры.ЦветФактурыПредставление = ЦветФактурыПредставление;
						//ОбластьМакета.Параметры.ЦветФактуры = ВыборкаЦветов.ЦветФактуры;
						Таб.Присоединить(ОбластьМакета, 4);
					Иначе
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Данные");
						ОбластьМакета.Параметры.ЦветФактурыПредставление = ЦветФактурыПредставление;
						ОбластьМакета.Параметры.ЦветФактуры = ВыборкаЦветов.ЦветФактуры;
						Таб.Вывести(ОбластьМакета, 4);	
					КонецЕсли;
					
					
					Для НомерЦены = 0 По СписокВидовЦенМатериалов.Количество() - 1 Цикл
						ОбластьМакета = Макет.ПолучитьОбласть("Строка|Цена");
						ОбластьМакета.Параметры.Цена = ЦеныНоменклатуры.Получить(СписокВидовЦенМатериалов.Получить(НомерЦены).Значение);
						ОбластьМакета.Параметры.ЦенаСФотопечатью = ЦеныСФотоНоменклатуры.Получить(СписокВидовЦенМатериалов.Получить(НомерЦены).Значение);
						Таб.Присоединить(ОбластьМакета, 4);
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
		
КонецПроцедуры

Функция ТекстЗапросаЦенУслугРаскроя()
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникВидыЦен.Ссылка КАК ВидЦены,
	|	ВЫБОР
	|		КОГДА СправочникВидыЦен.СсылочныйВидЦены = ИСТИНА
	|			ТОГДА СправочникВидыЦен.ВидЦеныНаУслугиПроизводства
	|		ИНАЧЕ СправочникВидыЦен.Ссылка
	|	КОНЕЦ КАК ВидЦеныРасчетный
	|ПОМЕСТИТЬ ВТ_ВидыЦен
	|ИЗ
	|	Справочник.ВидыЦен КАК СправочникВидыЦен
	|ГДЕ
	|	СправочникВидыЦен.Ссылка В(&ВидЦены)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Валюта КАК Валюта,
	//|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ВидЦен КАК ВидЦен,
	|	ВТ_ВидыЦен.ВидЦены КАК ВидЦены,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.Углы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК Углы,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ВырезыApply.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК ВырезыApply,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.Фотопечать.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК Фотопечать,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ДлинаШвов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК ДлинаШвов,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ДлинаПользовательскихШвов.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК ДлинаПользовательскихШвов,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ВнутренниеВырезы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК ВнутренниеВырезы,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.Кривые.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК Кривые,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.ДлинаШвовМногофактурный.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		КоличествоОт КАК КоличествоОт,
	|		КоличествоДо КАК КоличествоДо,
	|		Цена КАК Цена,
	|		Номенклатура КАК Номенклатура
	|	) КАК ДлинаШвовМногофактурный,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ЦеныУслугРаскроя.СтоимостьУслугиЦентровкиШва КАК СтоимостьУслугиЦентровкиШва
	|ИЗ
	|	РегистрСведений.СоответствиеВидовЦенЦенамУслугРаскроя.СрезПоследних(
	|			&Период,
	//|			ВидЦен В (&ВидЦены) И
	|			ВидНоменклатуры = &ВидНоменклатуры И
	|			ВЫБОР
	|				КОГДА &ОтборПоВалюте
	|					ТОГДА Валюта = &Валюта
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ) КАК СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВидыЦен КАК ВТ_ВидыЦен
	|		ПО (ВТ_ВидыЦен.ВидЦеныРасчетный = СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ВидЦен)";
	
КонецФункции

Функция ТекстЗапросаИндивидуальныхЦенУслугРаскроя()
	Возврат
	"ВЫБРАТЬ
	|	""Индивидуальная цена"" КАК ВидЦены,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Валюта КАК Валюта,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Отменена КАК Отменена,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.ВидЦеныНаУслугиПроизводства КАК ВидЦеныНаУслугиПроизводства,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.Углы.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК Углы,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.ВырезыApply.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК ВырезыApply,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.Фотопечать.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК Фотопечать,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.ДлинаШвов.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК ДлинаШвов,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.ДлинаПользовательскихШвов.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК ДлинаПользовательскихШвов,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.ВнутренниеВырезы.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК ВнутренниеВырезы,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.Кривые.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК Кривые,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.ДлинаШвовМногофактурный.(
	|		Ссылка,
	|		НомерСтроки,
	|		КоличествоОт,
	|		КоличествоДо,
	|		Цена,
	|		Номенклатура
	|	) КАК ДлинаШвовМногофактурный,
	|	СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних.Документ.СтоимостьУслугиЦентровкиШва КАК СтоимостьУслугиЦентровкиШва
	|ИЗ
	|	РегистрСведений.СоответствиеИндивидуальныхЦенЦенамУслугРаскроя.СрезПоследних(
	|			&Период,
	|			ДоговорКонтрагента В (&ДоговорКонтрагента)
	|				И ВЫБОР
	|					КОГДА &ОтборПоВалюте
	|						ТОГДА Валюта = &Валюта
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК СоответствиеВидовЦенЦенамУслугРаскрояСрезПоследних";
	
КонецФункции

Процедура ВывестиТаблицуУслугРаскроя(ТаблицаДанных, Таб, Макет, ГруппаУслуг, ЗаголовокУслуг)
	
	//Если ТаблицаДанных[ГруппаУслуг].Количество() > 1 Тогда 
		//несколько услуг
		ОбластьМакета = Макет.ПолучитьОбласть("ГруппаУслуг");
		ОбластьМакета.Параметры.Услуга = ЗаголовокУслуг;
		Таб.Вывести(ОбластьМакета, 2, ГруппаУслуг, Истина);
		
		ТаблицаДанных[ГруппаУслуг].Сортировать("КоличествоДо Возр");
		Для Каждого ТекУслуга Из ТаблицаДанных[ГруппаУслуг] Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Услуга");
			ОбластьМакета.Параметры.Заполнить(ТекУслуга);
			//ОбластьМакета.Параметры.Услуга = ЗаголовокУслуг + " с " + ТекУслуга.КоличествоОт + " по " + ТекУслуга.КоличествоДо;
			//ОбластьМакета.Параметры.Цена = ТекУслуга.Цена;
			Таб.Вывести(ОбластьМакета, 3, ГруппаУслуг+1, Истина);
		КонецЦикла;
		
	//Иначе
	//	//одна услуга
	//	Для Каждого ТекУслуга Из ТаблицаДанных[ГруппаУслуг] Цикл
	//		ОбластьМакета = Макет.ПолучитьОбласть("УслугаБезОтступа");
	//		ОбластьМакета.Параметры.Услуга = ЗаголовокУслуг;
	//		ОбластьМакета.Параметры.Цена = ТекУслуга.Цена;
	//		Таб.Вывести(ОбластьМакета, 2, ГруппаУслуг, Истина);
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиУслугиПроизводства(ДатаОтчета, СписокВидовЦен, Макет, Таб, СтруктураПараметров)
	
	Таб.НачатьАвтогруппировкуСтрок();
	
	ИндУсловия = Ложь;
	Если СтруктураПараметров.ИндивидуальныеЦены Тогда		
		ЗапросИндЦены = Новый Запрос;
		ЗапросИндЦены.Текст = ТекстЗапросаИндивидуальныхЦенУслугРаскроя();
		ЗапросИндЦены.УстановитьПараметр("Период",  ДатаОтчета);
		ЗапросИндЦены.УстановитьПараметр("ДоговорКонтрагента", СтруктураПараметров.ДоговорКонтрагента);
		ЗапросИндЦены.УстановитьПараметр("Валюта", СтруктураПараметров.Валюта);
		ЗапросИндЦены.УстановитьПараметр("ОтборПоВалюте", ЗначениеЗаполнено(СтруктураПараметров.Валюта));
		ТаблицаЦены = ЗапросИндЦены.Выполнить().Выгрузить();
		Если ТаблицаЦены.Количество() > 0 Тогда
			Если НЕ ТаблицаЦены[0].Отменена Тогда
				ИндУсловия = Истина;
				//#7256
				Если ЗначениеЗаполнено(ТаблицаЦены[0].ВидЦеныНаУслугиПроизводства) Тогда
					// цены по ссылке на другой вид цен
					ИндЦена = Новый Массив;
					ИндЦена.Добавить(ТаблицаЦены[0].ВидЦеныНаУслугиПроизводства);
					Запрос = Новый Запрос;
					Запрос.Текст = ТекстЗапросаЦенУслугРаскроя();
					Запрос.УстановитьПараметр("Период",  ДатаОтчета);
					//Запрос.УстановитьПараметр("ОтборПоВидамЦен", Ложь);	
					Запрос.УстановитьПараметр("ВидЦены", ИндЦена); //Новый Массив);	
					//Запрос.УстановитьПараметр("ЦенаУслуг", ТаблицаЦены[0].ВидЦеныНаУслугиПроизводства);
					Запрос.УстановитьПараметр("Валюта", СтруктураПараметров.Валюта);
					Запрос.УстановитьПараметр("ОтборПоВалюте", ЗначениеЗаполнено(СтруктураПараметров.Валюта));
					ТаблицаЦены = Запрос.Выполнить().Выгрузить();					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ИндУсловия Тогда	
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапросаЦенУслугРаскроя();
		Запрос.УстановитьПараметр("Период",  ДатаОтчета);
		//Запрос.УстановитьПараметр("ОтборПоВидамЦен", Истина);
		Запрос.УстановитьПараметр("ВидЦены", СписокВидовЦен);
		//Запрос.УстановитьПараметр("ЦенаУслуг", Неопределено);
		Запрос.УстановитьПараметр("Валюта", СтруктураПараметров.Валюта);
		Запрос.УстановитьПараметр("ВидНоменклатуры", СтруктураПараметров.ВидНоменклатурыПотолки);
		Запрос.УстановитьПараметр("ОтборПоВалюте", ЗначениеЗаполнено(СтруктураПараметров.Валюта));
		ТаблицаЦены = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Если ТаблицаЦены.Количество() > 0 Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
		Таб.Вывести(ОбластьМакета);
		
		Для Каждого ТекВидЦен Из ТаблицаЦены Цикл
			//Если Отчет.НесколькоВидовЦен Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("ВидЦен");
				ОбластьМакета.Параметры.ВидЦены = ВРЕГ(ТекВидЦен.ВидЦены) + " (" + ТекВидЦен.Валюта + ")";
				Таб.Вывести(ОбластьМакета, 1, "ВидЦен", Истина);
			//КонецЕсли;
			
			Если ТекВидЦен.Углы.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "Углы", "Углы");
			КонецЕсли;
			Если ТекВидЦен.ВырезыApply.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "ВырезыApply", "Вырезы Apply");
			КонецЕсли;
			Если ТекВидЦен.Фотопечать.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "Фотопечать", "Фотопечать");
			КонецЕсли;
			Если ТекВидЦен.ДлинаШвов.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "ДлинаШвов", "Швы по длине");
			КонецЕсли;
			Если ТекВидЦен.ДлинаПользовательскихШвов.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "ДлинаПользовательскихШвов", "Дополнительные швы по длине");
			КонецЕсли;
			Если ТекВидЦен.ВнутренниеВырезы.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "ВнутренниеВырезы", "Внутренние вырезы");
			КонецЕсли;
			Если ТекВидЦен.Кривые.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "Кривые", "Криволинейный участок");
			КонецЕсли;
			Если ТекВидЦен.ДлинаШвовМногофактурный.Количество() > 0 Тогда
				ВывестиТаблицуУслугРаскроя(ТекВидЦен, Таб, Макет, "ДлинаШвовМногофактурный", "Швы в многофактурном потолке по длине");
			КонецЕсли;
			
			Если НЕ ТекВидЦен.СтоимостьУслугиЦентровкиШва = 0 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("УслугаБезОтступа");
				ОбластьМакета.Параметры.Услуга = "Центровка шва в % от заказа";
				ОбластьМакета.Параметры.Цена = ТекВидЦен.СтоимостьУслугиЦентровкиШва;
				Таб.Вывести(ОбластьМакета, 2, "ЦентровкаШва", Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

Процедура ПрисоединитьТабличныйДокумент(ОсновнойДокумент, Знач ПрисоединяемыйДокумент)
	
	ВремТабДок = Новый ТабличныйДокумент;
	ОбластьЯчеек = ВремТабДок.Вывести(ПрисоединяемыйДокумент);
	
	ОбластьЯчеек.СоздатьФорматСтрок();
	
	ОсновнойДокумент.Вывести(ВремТабДок);
	
КонецПроцедуры



//Процедура УДАЛИТЬ_СформироватьНаСервереВсе()
//		
//	СписокВидовЦен = Новый СписокЗначений;
//	СтруктураПараметров = Новый Структура;	
//	ИнициализацияПараметровОтчета(СписокВидовЦен, СтруктураПараметров);
//	
//	ТекОбъект = РеквизитФормыВЗначение("Отчет");
//	Макет = ТекОбъект.ПолучитьМакет("Макет");
//	Таб = Новый ТабличныйДокумент;
//	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПрайсЛист";
//	
//	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаПрайса");
//	ОбластьМакета.Параметры.Организация = Отчет.Организация;
//	ОбластьМакета.Параметры.Дата = Формат(Отчет.Дата,"ДЛФ=ДД");
//	Таб.Вывести(ОбластьМакета);	
//		
//	//КОМПЛЕКТУЮЩИЕ
//	ТабВрем = Новый ТабличныйДокумент;
//	ВывестиКомплектующие(СтруктураПараметров, Макет, ТабВрем);
//	ПрисоединитьТабличныйДокумент(Таб, ТабВрем);
//		
//	//ПОТОЛКИ
//	ТабВрем = Новый ТабличныйДокумент;
//	МакетПотолки = ТекОбъект.ПолучитьМакет("МакетПотолки");
//	ВывестиЦеныНаПродукцию(СтруктураПараметров, МакетПотолки, ТабВрем);
//	ПрисоединитьТабличныйДокумент(Таб, ТабВрем);
//	
//	//УСЛУГИ ПРОИЗВОДСТВА
//	ТабВрем = Новый ТабличныйДокумент;
//	Макет = ТекОбъект.ПолучитьМакет("МакетУслугиРаскроя");	
//	ВывестиУслугиПроизводства(Отчет.Дата, СписокВидовЦен, Макет, ТабВрем, СтруктураПараметров);
//	ПрисоединитьТабличныйДокумент(Таб, ТабВрем);
//	
//	ТабличныйДокумент=Таб;
//	
//КонецПроцедуры
