&НаКлиенте
Перем мПредыдущийИдентификатор;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВключитьПредпросмотрФайлов = НЕ Константы.ВыключитьПредпросмотрПрикрепленныхФайловВДокументах.Получить();
	Элементы.ГруппаФайлыПредпросмотр.Видимость = ВключитьПредпросмотрФайлов;
	
	Если Параметры.Ключ.Пустая() Тогда

	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СофтФонСервер.ПриСозданииНаСервере(ЭтотОбъект);
	МессенджерыСервер.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ГруппаКонтрагентКПМессенджеры);
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
	ЭтоДокументОбеспеченияРозницы = ЗначениеЗаполнено(Объект.Основание) 
									И (ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") ИЛИ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Монтаж"));	
	Элементы.ТоварыГруппаРозница.Видимость = ЭтоДокументОбеспеченияРозницы;
	Если ЭтоДокументОбеспеченияРозницы Тогда
		УстановитьПривилегированныйРежим(Истина);
		СписокКомнатОснования.ЗагрузитьЗначения(Документы.ЗаказДоговор.ПолучитьМассивКомнатДоговора(Объект.Основание));
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	//#14675
	Элементы.ТоварыКомната.Видимость = Объект.СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам;
	
	ОбновитьДанныеДокумента();
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
	//++ №11597 перенесено в модуль менеджера
	//ИспользоватьЗаявкиНаРасходованиеДенежныхСредств = Константы.ИспользоватьЗаявкиНаРасходованиеДенежныхСредств.Получить();
	//Если ИспользоватьЗаявкиНаРасходованиеДенежныхСредств Тогда
	//	Если Элементы.Найти("ФормаДокументСписаниеСРасчетногоСчетаСоздатьНаОсновании") <> Неопределено Тогда
	//		Элементы.ФормаДокументСписаниеСРасчетногоСчетаСоздатьНаОсновании.Видимость = Ложь;
	//	КонецЕсли;
	//	Если Элементы.Найти("ФормаДокументРасходныйКассовыйОрдерСоздатьНаОсновании") <> Неопределено Тогда
	//		Элементы.ФормаДокументРасходныйКассовыйОрдерСоздатьНаОсновании.Видимость = Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	//-- №11597 перенесено в модуль менеджера
		
	ИспользоватьПодключаемоеОборудование = Константы.ИспользоватьПодключаемоеОборудование.Получить();
		
	ОбщийМодульСервер.ДобавитьИндикаторРаботыСоСканерамиШК(ЭтотОбъект);	
	
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма);
	
	//#9470
	ОтображатьПредыдущуюЦенуПоступления = Константы.ОтображатьПредыдущуюЦенуПоступленияВДокументахЗакупки.Получить();
	Элементы.ТоварыЦенаПредыдущегоПоступления.Видимость = ОтображатьПредыдущуюЦенуПоступления;
	ЗаполнитьЦеныПредыдущегоПоступления();

	ОбщийМодульСервер.УстановитьВидимостьПодразделения(ЭтотОбъект);
	
	УчитыватьНДС = Истина;
	СтавкаНДСПоУмолчанию = Перечисления.СтавкиНДС.НДС22;
	
	//nva+++
	ИспользоватьКонтрольКратности = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольКратностиЕдиницИзмерения");
	Если Параметры.Ключ.Пустая() Тогда
        Объект.ТекущийСтатус = Справочники.СтатусыЗаказовПоставщику.Новый;
	КонецЕсли;
	Если НЕ Параметры.Ключ.Пустая() Тогда
		РассчитатьИтоговыйВес(Объект.Товары, ИтогВес);
	КонецЕсли;
	//nva---
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиентПереопределяемый.НачатьПодключениеОборудованиеПриОткрытииФормы(ЭтаФорма, "СканерШтрихкода");
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанЗаказПоставщику",Объект.Основание,"ЗаказПоставщику");
	Оповестить("Запись_ЗаказПоставщику", Объект.Ссылка);
	
	Если (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) 
		И ЭтоДокументОбеспеченияРозницы Тогда	
		Оповестить("ЗаписьДокументаОбеспеченияРозницы", Объект.Основание, "ЗаказПоставщику");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ЗаполнитьЦеныПредыдущегоПоступления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаНоменклатурыИзExcel.Форма.ЗагрузкаВТабличнуюЧасть" Тогда
		
		ПолучитьЗагруженныеТоварыИзХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеПлощадиПотолкаВКарточкеНоменклатуры" и Источник = "Номенклатура" Тогда
		ОбработкаОповещенияНаСервере(Параметр);
	ИначеЕсли Источник = "ПодключаемоеОборудование" И ИмяСобытия = "ScanData" И ВводДоступен() И НЕ ЭтаФорма.ТолькоПросмотр Тогда		
		ОбработатьШтрихкод(Параметр);
	//++ №3172
	ИначеЕсли ИмяСобытия = "ЗакрытиеЗаказаПоставщикуОтЦентраСобытий" 
		И Параметр = Объект.Ссылка
		И Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовПоставщику.ВРаботе")
	Тогда
		ПеревестиЗаказВСтатусВыполнен();
	//-- №3172
	КонецЕсли;
	
КонецПроцедуры

//nva+++
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	//#2792
	Если ИспользоватьКонтрольКратности Тогда
		ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(Отказ, Объект, Перечисления.ВидыДокументовПроверкиКратности.ЗаказПоставщику);
	КонецЕсли;
	
КонецПроцедуры
//nva---


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	ЗаполнитьЦеныПредыдущегоПоступления();
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	//Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	ОбщийМодульСервер.ДополнительнаяИнформацияПоКонтрагентуНаФорме(Объект.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	ОбщийМодульСервер.РегулировкаШириныПоляКонтрагента(Элементы, Элементы.Контрагент, Элементы.ПоказатьДополнительнуюИнформацию);
	
	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;
	ДоговорКонтрагентаПриИзмененииНаСервере();
	
	//nva+++
	Если ЗначениеЗаполнено(Объект.Контрагент.СпособДоставкиТовара) Тогда 
		Объект.СпособДоставкиТовара = Объект.Контрагент.СпособДоставкиТовара;
	Иначе
		Объект.СпособДоставкиТовара = "";	
	КонецЕсли;
	//nva+++
КонецПроцедуры

&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	ДоговорКонтрагентаПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ДоговорКонтрагентаПриИзмененииНаСервере()
	Объект.ВидЦеныПоставщика = Объект.ДоговорКонтрагента.ВидЦеныПоставщика;
	ЗаполнитьЦеныПредыдущегоПоступления();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьИсходящийЗвонок(Команда)
	СофтфонКлиент.ВыполнитьИсходящийЗвонок(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда)
	МессенджерыКлиент.ВыполнитьКомандуОтправитьСообщениеМессенджер(Команда, ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнено значение Контрагента";
		Сообщение.Поле = "Объект.Контрагент";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;			
				
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	ПараметрыПодбора.Вставить("ИспользоватьЦеныПоставщиков", Истина);
	ПараметрыПодбора.Вставить("ВидЦеныПоставщика", Объект.ВидЦеныПоставщика);
	ПараметрыПодбора.Вставить("Поставщик", Объект.Контрагент);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыТовары());
	
	//nva+++
	Если ИспользоватьКонтрольКратности Тогда
		ПараметрыПодбора.Вставить("ВидДокументаПроверкиКратности",ПредопределенноеЗначение("Перечисление.ВидыДокументовПроверкиКратности.ЗаказПоставщику")); //#2792
	КонецЕсли;
	//nva---
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
		
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		НоваяСтрока.Ячейка = ОбщийМодульДокументы.ПолучитьЯчейку(НоваяСтрока.Номенклатура, Объект.Склад);
		Если ТипЗнч(НоваяСтрока.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
			НоваяСтрока.Вес = НоваяСтрока.ЕдиницаИзмерения.Вес * НоваяСтрока.Количество;
		Иначе
			НоваяСтрока.Вес = 0;
		КонецЕсли;	
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, Ложь, Ложь, Ложь);
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
	КонецЦикла;
	ЗаполнитьЦеныПредыдущегоПоступления();
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоставщика(Команда)
			
	Если НЕ ЗначениеЗаполнено(Объект.ВидЦеныПоставщика) Тогда
		ТекстОшибки = "Не указан вид цены поставщика!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "Объект.ВидЦеныПоставщика");
		Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда 	
		Если Объект.Товары.Количество() = 0 Тогда
			Сообщить ("Таблица товаров пустая");
		Иначе
			ОП = Новый ОписаниеОповещения ("ЗаполнитьЦеныПоставщикаНаКлиенте",ЭтаФорма);
			ПоказатьВопрос(ОП, "Для каждой строки будут установлены цены поставщика, 
			|если они зарегистрированы в базе.
			|Продолжить?", РежимДиалогаВопрос.ОКОтмена,,,"Загрузить цены?");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоставщикаНаКлиенте(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда 
		ЗаполнитьЦеныПоставщикаНаСервере();
	КонецЕсли; 	
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоставщикаНаСервере()
	
	ОбработкаТабличныхЧастейСервер.ЗаполнитьЦеныПоставщика(ЭтотОбъект, "Товары");	
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныПоПредыдущимЗакупкам(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		Если Объект.Товары.Количество() = 0 Тогда
			Сообщить ("Таблица товаров пустая");
		Иначе	
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОПерезаполненииЦенПоПредыдущимЗакупкам", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, "Заполнить цены по предыдущим закупкам?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОПерезаполненииЦенПоПредыдущимЗакупкам(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьЦеныПоПредыдущимЗакупкамНаСервере();
		Модифицированность = Истина;
		ПоказатьОповещениеПользователя("Цены перезаполнены");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныПоПредыдущимЗакупкамНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗакупкиОбороты.КоличествоОборот КАК КоличествоОборот,
	|	ЗакупкиОбороты.СуммаОборот КАК СуммаОборот,
	|	ЗакупкиОбороты.Период КАК Период
	|ИЗ
	|	РегистрНакопления.Закупки.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Организация = &Организация
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента
	|				И Номенклатура = &Номенклатура
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ЗакупкиОбороты
	|ГДЕ
	|	ЗакупкиОбороты.Период < &Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("Период",Объект.Дата);
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент",Объект.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",Объект.ДоговорКонтрагента);
		
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		
		ТекущаяСтрока.Цена = 0;
		//ТекущаяСтрока.Сумма = 0;
		
		Запрос.УстановитьПараметр("Номенклатура", ТекущаяСтрока.Номенклатура);
		Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НЕ Выборка.КоличествоОборот = 0 Тогда
				ТекущаяСтрока.Цена = (Выборка.СуммаОборот / Выборка.КоличествоОборот) * ТекущаяСтрока.Коэффициент;
				//ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество; 				
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, Ложь, Ложь, Ложь);
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
		
	КонецЦикла;
	
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыТовары

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		//#15677 закомментировано
        //Элемент.ТекущиеДанные.СтавкаНДС = СтавкаНДСПоУмолчанию;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные = ОбработкаТабличныхЧастейКлиент.ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "ЕдиницаИзмерения, Коэффициент, СтавкаНДС");  //nva
	
	СтрокаТабличнойЧасти.Количество = 1;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	//nva+++                                                                                                                                                                     
	СтрокаТабличнойЧасти.Ячейка = ПолучитьЯчейкуНаСервере(СтрокаТабличнойЧасти.Номенклатура, Объект.Склад);
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
		СтрокаТабличнойЧасти.Вес = ПолучитьВесЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения) * СтрокаТабличнойЧасти.Количество;
	Иначе
		СтрокаТабличнойЧасти.Вес = 0;
	КонецЕсли;
	
	ИтогВес = Объект.Товары.Итог("Вес");
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Количество, СтавкаНДС");
	//nva---
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ОчиститьСообщения(); //nva
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	//nva+++
	Если ИспользоватьКонтрольКратности Тогда
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
		ОтказВИзмененииКоличества = Ложь;
		ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества);
		Если ОтказВИзмененииКоличества Тогда
			СтрокаТабличнойЧасти.Количество = 0;
		КонецЕсли;
	КонецЕсли;
	//nva---
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

//nva+++ 
&НаСервере
Функция ПолучитьЯчейкуНаСервере(Номенклатура, Склад)
	Возврат ОбщийМодульДокументы.ПолучитьЯчейку(Номенклатура, Склад); 
КонецФункции

&НаСервере
Процедура ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества)
	
	ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(ОтказВИзмененииКоличества, СтруктураДанные, Перечисления.ВидыДокументовПроверкиКратности.ЗаказПоставщику);
	
КонецПроцедуры
//nva---

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	//СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	//Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
	//	СтрокаТабличнойЧасти.Коэффициент = 1;
	//Иначе
	//	СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//КонецЕсли;
	//
	//СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//
	//ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	//ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

	//ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);                               
	//nva+++
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Коэффициент, Количество");  //#2792 добавлено Количество
	
	СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	
	Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
		СтрокаТабличнойЧасти.Вес = ПолучитьВесЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения) * СтрокаТабличнойЧасти.Количество;
	Иначе
		СтрокаТабличнойЧасти.Вес = 0;
	КонецЕсли;
	
	ИтогВес = Объект.Товары.Итог("Вес");
	
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	//nva---
КонецПроцедуры

&НаСервере
Функция ПолучитьВесЕдиницыИзмерения(ЕдиницаИзмерения) 
	
	Возврат ЕдиницаИзмерения.Вес;
	
КонецФункции 	

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если НЕ СтрокаТабличнойЧасти.Количество = 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПеревестиЗаказВСтатусВыполнен()
	
	мПредыдущийСтатус = Объект.ТекущийСтатус;
	
	Попытка
		
		Объект.ТекущийСтатус = ПредопределенноеЗначение("Справочник.СтатусыЗаказовПоставщику.Выполнен");
		
		ЭтотОбъект.Записать();
		
	Исключение
		
		Объект.ТекущийСтатус = мПредыдущийСтатус;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоговыеПоказателиКлиент()
	
	ИтогСумма = 0;
	РассчитатьИтоговыеПоказатели(Объект.Товары, ИтогСумма, ИтогСуммаНДС, ИтогВес);
	Если НЕ Объект.СуммаДокумента = ИтогСумма Тогда
		Объект.СуммаДокумента = ИтогСумма;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоговыеПоказателиСервер()
	
	ИтогСумма = 0;
	РассчитатьИтоговыеПоказатели(Объект.Товары, ИтогСумма, ИтогСуммаНДС, ИтогВес);
	Если НЕ Объект.СуммаДокумента = ИтогСумма Тогда
		Объект.СуммаДокумента = ИтогСумма;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказатели(ТаблицаТоваров, ИтогСумма, ИтогСуммаНДС, ИтогВес)
                                                                                
	ИтогСумма = 0;
	ИтогСуммаНДС = 0;
	ИтогВес = 0;

	Для каждого СтрокаТабличнойЧасти из ТаблицаТоваров Цикл
		ИтогСумма = ИтогСумма + СтрокаТабличнойЧасти.Сумма;
		ИтогСуммаНДС = ИтогСуммаНДС + СтрокаТабличнойЧасти.СуммаНДС; 
		ИтогВес = ИтогВес + СтрокаТабличнойЧасти.Вес;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура РассчитатьИтоговыйВес(ТаблицаТоваров, ИтогВес)
                                                                                
	ИтогВес = 0;

	Для каждого СтрокаТабличнойЧасти из ТаблицаТоваров Цикл
		Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерений") Тогда
			СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.ЕдиницаИзмерения.Вес * СтрокаТабличнойЧасти.Количество;
		Иначе
			СтрокаТабличнойЧасти.Вес = 0;
		КонецЕсли;	
		ИтогВес = ИтогВес + СтрокаТабличнойЧасти.Вес;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

&НаСервере
Процедура ОбновитьДанныеДокумента()
	
	ОбновитьСписокФайлов();
	//Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") И Не Объект.Основание.Пустая() Тогда
	//	Элементы.ТаблицаФайлы.Видимость = Истина;
	//	ОбновитьСписокФайлов();
	//Иначе
	//	//Элементы.ТаблицаФайлы.Видимость = Ложь;
	//КонецЕсли;
	
    ЗаполнитьМинМаксОстаток();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМинМаксОстаток()
		//nva+++
	ТЗТовары = Новый ТаблицаЗначений;
	// Добавляем колонки с указанием типов
	ТЗТовары.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	ТЗТовары.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения"));
	ТЗТовары.Колонки.Добавить("ИсходныйНомерСтроки", Новый ОписаниеТипов("Число"));
	ТЗТовары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	ТЗТовары.Колонки.Добавить("Комната", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(100)));
	ТЗТовары.Колонки.Добавить("Коэффициент", Новый ОписаниеТипов("Число"));
	ТЗТовары.Колонки.Добавить("Назначение", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(100)));
	ТЗТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗТовары.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	ТЗТовары.Колонки.Добавить("Потолок", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗТовары.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.Спецификации"));
	ТЗТовары.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТЗТовары.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	ТЗТовары.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	ТЗТовары.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗТовары.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	ТЗТовары.Колонки.Добавить("ЦенаПредыдущегоПоступления", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 2)));
	ТЗТовары.Колонки.Добавить("Ячейка", Новый ОписаниеТипов("Строка",,, Новый КвалификаторыСтроки(100)));
	
	ТЗТовары = Объект.Товары.Выгрузить();
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТабТовары", ТЗТовары);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Товар.Вес КАК Вес,
	               |	Товар.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	Товар.ИсходныйНомерСтроки КАК ИсходныйНомерСтроки,
	               |	Товар.Количество КАК Количество,
	               |	Товар.Комната КАК Комната,
	               |	Товар.Коэффициент КАК Коэффициент,
	               |	Товар.Назначение КАК Назначение,
	               |	Товар.Номенклатура КАК Номенклатура,
	               |	Товар.НомерСтроки КАК НомерСтроки,
	               |	Товар.Потолок КАК Потолок,
	               |	Товар.Спецификация КАК Спецификация,
	               |	Товар.СтавкаНДС КАК СтавкаНДС,
	               |	Товар.Сумма КАК Сумма,
	               |	Товар.СуммаНДС КАК СуммаНДС,
	               |	Товар.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	Товар.Цена КАК Цена,
	               |	Товар.ЦенаПредыдущегоПоступления КАК ЦенаПредыдущегоПоступления,
	               |	Товар.Ячейка КАК Ячейка
	               |ПОМЕСТИТЬ ВТ_ТЧ
	               |ИЗ
	               |	&ТабТовары КАК Товар
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТЧ.Вес КАК Вес,
	               |	ВТ_ТЧ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ВТ_ТЧ.ИсходныйНомерСтроки КАК ИсходныйНомерСтроки,
	               |	ВТ_ТЧ.Количество КАК Количество,
	               |	ВТ_ТЧ.Комната КАК Комната,
	               |	ВТ_ТЧ.Коэффициент КАК Коэффициент,
	               |	ВТ_ТЧ.Назначение КАК Назначение,
	               |	ВТ_ТЧ.Номенклатура КАК Номенклатура,
	               |	ВТ_ТЧ.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ТЧ.Потолок КАК Потолок,
	               |	ВТ_ТЧ.Спецификация КАК Спецификация,
	               |	ВТ_ТЧ.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_ТЧ.Сумма КАК Сумма,
	               |	ВТ_ТЧ.СуммаНДС КАК СуммаНДС,
	               |	ВТ_ТЧ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ВТ_ТЧ.Цена КАК Цена,
	               |	ВТ_ТЧ.ЦенаПредыдущегоПоступления КАК ЦенаПредыдущегоПоступления,
	               |	ВТ_ТЧ.Ячейка КАК Ячейка,
	               |	МинимальныеОстаткиНоменклатуры.Количество КАК МинОстаток,
	               |	МинимальныеОстаткиНоменклатуры.КоличествоМаксимум КАК МаксОстаток
	               |ИЗ
	               |	ВТ_ТЧ КАК ВТ_ТЧ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МинимальныеОстаткиНоменклатуры КАК МинимальныеОстаткиНоменклатуры
	               |		ПО ВТ_ТЧ.Номенклатура = МинимальныеОстаткиНоменклатуры.Номенклатура
	               |			И (МинимальныеОстаткиНоменклатуры.Склад = &Склад)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	
	Запрос.Параметры.Вставить("Склад",Объект.Склад);
	Результат = Запрос.Выполнить().Выгрузить();
	//Объект.Товары.Загрузить(Результат);        
	Для Каждого СтрокаТЧТовары Из Объект.Товары Цикл
		СтрокаРезультата = Результат.Найти(СтрокаТЧТовары.НомерСтроки, "НомерСтроки"); 
		Если СтрокаРезультата <> Неопределено Тогда
			СтрокаТЧТовары.МаксОстаток = СтрокаРезультата.МаксОстаток; 
			СтрокаТЧТовары.МинОстаток = СтрокаРезультата.МинОстаток;
		КонецЕсли;	
	КонецЦикла;	
	//nva---	
КонецПроцедуры	

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыТовары()
	
	Возврат Справочники.Номенклатура.ПолучитьСписокВидовНоменклатурыТовары();
	
КонецФункции

&НаКлиенте
Процедура ТоварыПотолокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если ЭтоПотолокИлиОтрез(ТекущаяСтрока.Номенклатура) Тогда
			ДанныеВыбора.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЭтоПотолокИлиОтрез(ПозицияНоменклатуры)
	Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ПозицияНоменклатуры);
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////
//ФУНКЦИИ РАБОТЫ С ТАБЛИЦОЙ ФАЙЛЫ
&НаСервере
Процедура ОбновитьСписокФайлов()
	
	Файлы.Очистить();
	
	МассивСсылок = Новый Массив;
	//номенклатуры
	Для Каждого СтрокаНоменклатура Из Объект.Товары Цикл
		МассивСсылок.Добавить(СтрокаНоменклатура.Номенклатура);
	КонецЦикла;
	//документ
	МассивСсылок.Добавить(Объект.Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект КАК Номенклатура,
	|	ПрикрепленныеДанные.ИмяФайла,
	|	ПрикрепленныеДанные.Расширение,
	|	ПрикрепленныеДанные.ИмяФайла + ""."" + ПрикрепленныеДанные.Расширение КАК НаименованиеФайла,
	|	ПрикрепленныеДанные.Период КАК ДатаПрикрепления
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект В (&МассивСсылок)";
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Файлы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	Если Файлы.Количество() > 0 Тогда
		Элементы.ТаблицаФайлы.Заголовок = "Файлы (" + Файлы.Количество() + ")";
	Иначе
		Элементы.ТаблицаФайлы.Заголовок = "Файлы";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанные(СсылкаНаОбъект, ИмяФайла)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанные.Данные
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанные КАК ПрикрепленныеДанные
	|ГДЕ
	|	ПрикрепленныеДанные.СсылкаНаОбъект = &Ссылка
	|	И ПрикрепленныеДанные.ИмяФайла = &ИмяФайла";
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИмяФайла",ИмяФайла);
	
	
	Данные = Неопределено;
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 тогда
		Данные = Выборка[0].Данные.Получить();
	КонецЕсли;
	 
	Возврат ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяВременногоФайлаСерв(Расширение)
	Возврат ПолучитьИмяВременногоФайла(Расширение);
КонецФункции

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.Файлы.ТекущиеДанные.Номенклатура.Пустая() Тогда
		АдресФайла = ПолучитьДанные(Объект.Ссылка, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	Иначе
		АдресФайла = ПолучитьДанные(Элементы.Файлы.ТекущиеДанные.Номенклатура, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	КонецЕсли;
	ВременноеИмя=ПолучитьИмяВременногоФайлаСерв(Элементы.Файлы.ТекущиеДанные.Расширение);
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	СписокПотолков = ПолучитьСписокПотолков();
	Если НЕ СписокПотолков.Количество() = 0 Тогда
		Оп = Новый ОписаниеОповещения("ВыборПотолкаДляПрикрепленияФайла", ЭтаФорма);
		ПоказатьВыборИзМеню(Оп, СписокПотолков, Элементы.ФайлыДобавитьФайл);
	Иначе
		ПоказатьПредупреждение(,"В товарах и материалах нет потолков и отрезов");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПотолков()
	
	СписокНоменклатуры = Новый СписокЗначений;
	Для Каждого СтрокаНоменклатура Из Объект.Товары Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаНоменклатура.Номенклатура) Тогда
			СписокНоменклатуры.Добавить(СтрокаНоменклатура.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ВыборПотолкаДляПрикрепленияФайла(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(ВыбранныйЭлемент.Значение, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПрикрепленияФайлаЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
	
	Если СтруктураРезультата.Результат Тогда
		ОбновитьСписокФайлов();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьФайл(Команда)
	
	ВыбранныеЭлементы = Элементы.Файлы.ВыделенныеСтроки;
	
	Если ВыбранныеЭлементы.Количество() > 0 Тогда
		Для каждого ЭлементДляПечати из ВыбранныеЭлементы Цикл
			СтрФайл = Файлы.НайтиПоИдентификатору(ЭлементДляПечати);
			Если СтрФайл.Номенклатура.Пустая() Тогда
				АдресФайла = ПолучитьДанные(Объект.Ссылка, СтрФайл.ИмяФайла);
			Иначе
				АдресФайла = ПолучитьДанные(СтрФайл.Номенклатура, СтрФайл.ИмяФайла);
			КонецЕсли;
			
			ВременноеИмя = ПолучитьИмяВременногоФайла(СтрФайл.Расширение);
			ПолучитьФайл(АдресФайла, ВременноеИмя, Ложь);
			
			Shell = Новый COMОбъект("Shell.Application");
			Shell.ShellExecute(ВременноеИмя, "", "", "print", 0);
		КонецЦикла;
	Иначе
		ПоказатьПредупреждение(,"Выберите файл(ы) в списке");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(Параметр)
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Если ТекущаяСтрока.Номенклатура = Параметр.Номенклатура Тогда
			ТекущаяСтрока.Количество = Параметр.НоваяПлощадьПотолка;
			//ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(ТекущаяСтрока, Ложь, Ложь, Ложь);
			ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(ТекущаяСтрока, УчитыватьНДС);
		КонецЕсли;
	КонецЦикла;
	
	Модифицированность = Истина;
	
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлКЗаказу(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(, "Заказ предварительно должен быть записан");
		Возврат;
	КонецЕсли;
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПрикрепленияФайлаЗавершение", ЭтотОбъект);
	ДопПараметры = Новый Структура("ДействиеПослеПрикрепления", ОписаниеОповещения);
	ОбщийМодульКлиент.ПослеВыбораСсылкиДляПрикрепленияФайла(Объект.Ссылка, ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПриАктивизацииСтроки(Элемент)
	
	Если НЕ ВключитьПредпросмотрФайлов ИЛИ Элементы.Файлы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если мПредыдущийИдентификатор = Элементы.Файлы.ТекущиеДанные.ПолучитьИдентификатор() Тогда
		Возврат;
	Иначе
		мПредыдущийИдентификатор = Элементы.Файлы.ТекущиеДанные.ПолучитьИдентификатор();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбработчикОжиданияФайлыПриАктивизацииСтроки", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОжиданияФайлыПриАктивизацииСтроки()
	
	Если Элементы.Файлы.ТекущиеДанные.Номенклатура.Пустая() Тогда
		АдресФайла = ПолучитьДанные(Объект.Ссылка, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	Иначе
		АдресФайла = ПолучитьДанные(Элементы.Файлы.ТекущиеДанные.Номенклатура, Элементы.Файлы.ТекущиеДанные.ИмяФайла);
	КонецЕсли;
	
	ОбщийМодульКлиент.ПредпросмотрФайла(АдресФайла, Элементы.Файлы.ТекущиеДанные.Расширение, Предпросмотр, Элементы.Предпросмотр);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	//ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Для Каждого ВыделеннаяСтрока Из Элементы.Товары.ВыделенныеСтроки Цикл
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если ЭтоПотолокИУНегоЕстьУслугиВТЧ(ТекущиеДанные.Номенклатура) Тогда
			//Если это потолок и у него есть услуги в ТЧ, зададим вопрос об удалении их из ТЧ
			ОП = новый ОписаниеОповещения("ПослеВопросаОУдаленииУслугиПоПотолку", ЭтотОбъект, новый Структура("Потолок", ТекущиеДанные.Номенклатура));
			ПоказатьВопрос(ОП, "В табличной части услуги есть позиции, которые привязаны к данному потолоку, удалить услуги?", РежимДиалогаВопрос.ДаНет,,, "Удаление связанных услуг по потолку");		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	РассчитатьИтоговыеПоказателиКлиент();
	
КонецПроцедуры

&НаСервере
Функция	ЭтоПотолокИУНегоЕстьУслугиВТЧ(Номенклатура)
	
	УсловиеВыполнено = Ложь;
	
	Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(Номенклатура) Тогда
		Для Каждого СтрокаУслуга Из Объект.Товары Цикл
			Если ЭтоУслуга(СтрокаУслуга.Номенклатура) И СтрокаУслуга.Потолок = Номенклатура И НЕ СтрокаУслуга.Потолок.Пустая() Тогда
				УсловиеВыполнено = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат УсловиеВыполнено;
	
КонецФункции

&НаКлиенте
Процедура ПослеВопросаОУдаленииУслугиПоПотолку(Ответ, ДопПараметры) ЭКСПОРТ
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Для Каждого СтрокаУслуга Из Объект.Товары Цикл
			Если ЭтоУслуга(СтрокаУслуга.Номенклатура) И СтрокаУслуга.Потолок = ДопПараметры.Потолок И НЕ СтрокаУслуга.Потолок.Пустая() Тогда
				Объект.Товары.Удалить(СтрокаУслуга);		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ЭтоУслуга(Номенклатура)
	 Возврат Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(Номенклатура);
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДокументПоЗаказу(Команда)
	
	Если  НЕ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") 
		И НЕ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		ПоказатьПредупреждение(,"Документ не на основании заказа покупателя или заказ-договора");
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Документ предварительно необходимо записать");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОЗаполненииПоЗаказу", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Документ будет очищен и перезаполнен. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОЗаполненииПоЗаказу(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьДокументПоЗаказуПокупателяНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументПоЗаказуПокупателяНаСервере()
	
	//ДокОбъект = Объект.Ссылка.ПолучитьОбъект();
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.Товары.Очистить();		
	ДокОбъект.Заполнить(Объект.Основание);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект")
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПотолокПоОснованию(Команда)
	
		СписокВариантов = ПолучитьСписокПОтолковОснования();
		
		Если СписокВариантов.Количество() = 0 Тогда
			ПоказатьПредупреждение(,"В документе-основании нет потолков");
			Возврат;
		КонецЕсли;
			
		
		Оп = Новый ОписаниеОповещения("ВыборПотолкаДляЗаполненияПоОснованию", ЭтаФорма);
		
		СписокВариантов.ПоказатьВыборЭлемента(Оп, "Выберите потолок");

	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПОтолковОснования()
	
	СписокПотолков = Новый СписокЗначений;
	
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Для Каждого СтрокаОснования из Объект.Основание.Товары Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаОснования.Номенклатура) Тогда
				СписокПотолков.Добавить(СтрокаОснования.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Для Каждого СтрокаОснования из Объект.Основание.ТоварыУслуги Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаОснования.Номенклатура) Тогда
				СписокПотолков.Добавить(СтрокаОснования.Номенклатура);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СписокПотолков;
	
КонецФункции

&НаКлиенте
Процедура ВыборПотолкаДляЗаполненияПоОснованию(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	Если НЕ ВыбранныйЭлемент = Неопределено Тогда
		ВыборПотолкаДляЗаполненияПоОснованиюНаСервере(ВыбранныйЭлемент.Значение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыборПотолкаДляЗаполненияПоОснованиюНаСервере(ВыбранныйПотолок)
	
	//удалим выбранный потолок и все что с ним связано из ТЧ
	КопияТЧ = Объект.Товары.Выгрузить();
	Объект.Товары.Очистить();
	Для Каждого СтрокаКопии Из КопияТЧ Цикл
		Если СтрокаКопии.Номенклатура = ВыбранныйПотолок ИЛИ СтрокаКопии.Потолок = ВыбранныйПотолок Тогда
			продолжить;
		Иначе
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКопии);
		КонецЕсли;
	КонецЦикла;
	
	//добавим выбранный потолок и все его подчиненные строки
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Для Каждого ТекСтрокаОснования Из Объект.Основание.Товары Цикл
			Если ТекСтрокаОснования.Номенклатура = ВыбранныйПотолок ИЛИ ТекСтрокаОснования.Потолок = ВыбранныйПотолок Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования, "Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, Потолок, Комната");
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		Для Каждого ТекСтрокаОснования Из Объект.Основание.ТоварыУслуги Цикл
			Если ТекСтрокаОснования.Номенклатура = ВыбранныйПотолок ИЛИ ТекСтрокаОснования.НомерПотолка = ВыбранныйПотолок.Потолок_НомерРасчета Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаОснования, "Номенклатура, ХарактеристикаНоменклатуры, Количество, ЕдиницаИзмерения, Коэффициент, Комната");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКомнатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(СписокКомнатОснования.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоПотребностиЗаказДоговора(Команда)
	
	Если НЕ ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаказДоговор") ИЛИ НЕ ЗначениеЗаполнено(Объект.Основание) Тогда
		ПоказатьПредупреждение(,"Документ не на основании заказ-договора");
		Возврат;
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеВопросаОРаспределенииПоОбеспечению", ЭтаФорма);
	ПоказатьВопрос(Оповещение, "Распределить по потребности заказ-договора?", Режим, 0);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОРаспределенииПоОбеспечению(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
        РаспределитьПоПотребностиЗаказДоговораНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьПоПотребностиЗаказДоговораНаСервере()
	
	ТоварыДокумента = Объект.Товары.Выгрузить();
	ТоварыРаспределение = ТоварыДокумента.СкопироватьКолонки();
	ТоварыДокумента.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, Спецификация, ЕдиницаИзмерения, Коэффициент, Цена, Потолок", "Количество, Сумма");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Основание", Объект.Основание);
	СтруктураПараметров.Вставить("Ссылка", Объект.Ссылка);
	СтруктураПараметров.Вставить("УчетОбеспеченностиРозницыПоКомнатам", Объект.СозданПриИспользованииНастройкиУчетОбеспеченностиРозницыПоКомнатам);
	
	ОбработкаТабличныхЧастейСервер.РаспределитьПоПотребностиЗаказДоговора(ТоварыДокумента, ТоварыРаспределение, СтруктураПараметров); 
		
	Объект.Товары.Загрузить(ТоварыРаспределение);
	ЗаполнитьЦеныПредыдущегоПоступления();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Параметр)
	
	СтруктураТовара = ОбщийМодульКлиент.ПолучитьНоменклатуруПоШтрихКоду(МенеджерОборудованияКлиентПереопределяемый.ПреобразоватьДанныеСоСканераВМассив(Параметр));
	
	Если НЕ СтруктураТовара.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда
		
		//Попробуем найти в ТЧ
		СтруктураПоиска = новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", СтруктураТовара.Номенклатура, СтруктураТовара.ХарактеристикаНоменклатуры, СтруктураТовара.ЕдиницаИзмерения);
		НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Объект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураТовара);
			НоваяСтрока.Количество = 1;
			Если ТипЗнч(НоваяСтрока.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
				НоваяСтрока.Коэффициент = 1;
			Иначе
				НоваяСтрока.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
			КонецЕсли;
			НоваяСтрока.СтавкаНДС = СтавкаНДСПоУмолчанию;
		Иначе
			НоваяСтрока = НайденныеСтроки[0];
			НоваяСтрока.Количество = НоваяСтрока.Количество + 1;
		КонецЕсли;	
		
		//НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(НоваяСтрока, Ложь, Ложь, Ложь);
		ОбработкаТабличныхЧастейКлиент.ПересчитатьСуммуНДСВСтрокеТЧ(НоваяСтрока, УчитыватьНДС);
	Иначе
		Сообщить("Не удалось найти номенклатуру со штрих-кодом " + СтруктураТовара.ШтрихКод);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуПоставщика(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения)
	
	Отбор = Новый Структура;
	Отбор.Очистить();
	Отбор.Вставить("Поставщик",			Объект.Контрагент);
	Отбор.Вставить("Валюта",			Объект.Валюта);
	Отбор.Вставить("Номенклатура", 		Номенклатура);
	Отбор.Вставить("ХарактеристикаНоменклатуры", 		ХарактеристикаНоменклатуры);
	Отбор.Вставить("ЕдиницаИзмерения", 	ЕдиницаИзмерения);
	Отбор.Вставить("ВидЦеныПоставщика", Объект.ВидЦеныПоставщика);
	Выборка = РегистрыСведений.ЦеныПоставщиков.ПолучитьПоследнее(Объект.Дата, Отбор);
	
	Возврат Выборка.Цена;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ОткрытьФорму(
		"Обработка.ЗагрузкаНоменклатурыИзExcel.Форма.ЗагрузкаВТабличнуюЧасть",
		ПараметрыФормы,
		ЭтаФорма,
		УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеНоменклатуры(Команда)
	
	//#4193
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТабличнаяЧасть", Объект.Товары);
	ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);

	ОбработкаТабличныхЧастейКлиент.ЗаполнитьТабличнуюЧастьПоГруппеНоменклатуры(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧастьПоГруппеНоменклатурыПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ЗаполнитьТабличнуюЧастьПоГруппеНоменклатурыСервер(Результат);
	ПоказатьОповещениеПользователя("Выполнено");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьПоГруппеНоменклатурыСервер(ГруппаНоменклатуры)
	
	ПараметрыЗаполнения = Новый Структура("ТабличнаяЧасть, ГруппаНоменклатуры", Объект.Товары, ГруппаНоменклатуры);
	ОбработкаТабличныхЧастейСервер.ЗаполнитьТабличнуюЧастьПоГруппеНоменклатурыСервер(ПараметрыЗаполнения);
	
	Для каждого СтрокаТабличнойЧасти из Объект.Товары Цикл
		СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	КонецЦикла;
	ЗаполнитьЦеныПредыдущегоПоступления();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗагруженныеТоварыИзХранилища(АдресТоваровВХранилище)
	
	ТоварыИзХранилища = ПолучитьИзВременногоХранилища(АдресТоваровВХранилище);
	
	Для Каждого СтрокаТоваров Из ТоварыИзХранилища Цикл
		СтрокаТЧТовары = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧТовары, СтрокаТоваров);
	КонецЦикла;
	
	РассчитатьИтоговыеПоказателиСервер();
	ЗаполнитьЦеныПредыдущегоПоступления();
	ОбновитьДанныеДокумента();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(УсловноеОформление.Элементы, Элементы.ТоварыЦенаПредыдущегоПоступления.Имя, 
			Новый ПолеКомпоновкиДанных("Объект.Товары.ЦенаПредыдущегоПоступления"), ВидСравненияКомпоновкиДанных.Больше, Новый ПолеКомпоновкиДанных("Объект.Товары.Цена"), WebЦвета.ЗеленыйЛес);
	
	//
	ОбщийМодульСервер.УстановитьУсловноеОформлениеЦветТекста(УсловноеОформление.Элементы, Элементы.ТоварыЦенаПредыдущегоПоступления.Имя, 
			Новый ПолеКомпоновкиДанных("Объект.Товары.ЦенаПредыдущегоПоступления"), ВидСравненияКомпоновкиДанных.Меньше, Новый ПолеКомпоновкиДанных("Объект.Товары.Цена"), WebЦвета.Красный);
	
КонецПроцедуры

//#9470
&НаСервере
Процедура ЗаполнитьЦеныПредыдущегоПоступления(Отбор=Неопределено)
	
	Если ОтображатьПредыдущуюЦенуПоступления Тогда	
		ОбщийМодульСервер.ЗаполнитьЦеныПредыдущегоПоступления(Объект, "Товары", Отбор);
	КонецЕсли;
	
КонецПроцедуры

//#9470
&НаКлиенте
Процедура ЗаполнитьЦеныПредыдущегоПоступленияВСтроке(СтрокаТабличнойЧасти)
	ЗаполнитьЦеныПредыдущегоПоступления(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения", СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения));
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДополнительнуюИнформацию(Команда)
	
	ОбщийМодульКлиент.ФормаДополнительнойИнформацииКонтрагента(Объект.Контрагент);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////////

//nva+++
&НаКлиенте 
Функция СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ИмяТаблицы = "Товары")
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			ИмяТаблицы);
	СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				"");
	СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	СтруктураДанные.Вставить("Организация",			Объект.Организация);
	СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);
	СтруктураДанные.Вставить("СтавкаНДС",			ПолучитьСтавкуНДСКонтрагента(Объект.Контрагент)); //nva
	СтруктураДанные.Вставить("ДоговорКонтрагента", 	Объект.ДоговорКонтрагента);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);

	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция ПолучитьСтавкуНДСКонтрагента(Контрагент)
	Возврат Контрагент.СтавкаНДС;
КонецФункции	

&НаСервере
Функция СтруктураДанныхПоСтрокеТабличнойЧастиСервер(СтрокаТабличнойЧасти, ИмяТаблицы = "Товары")
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			ИмяТаблицы);                          //#2792
	СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);  //#2792
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				"");
	СтруктураДанные.Вставить("Валюта", 				Объект.Валюта);
	СтруктураДанные.Вставить("Организация",			Объект.Организация);
	СтруктураДанные.Вставить("Подразделение",		Объект.Подразделение);
	СтруктураДанные.Вставить("Контрагент",			Объект.Контрагент);        
	СтруктураДанные.Вставить("СтавкаНДС",			Объект.Контрагент.СтавкаНДС);
	СтруктураДанные.Вставить("ДоговорКонтрагента", 	Объект.ДоговорКонтрагента);
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные)
	
	СтавкаНДС = СтруктураДанные.СтавкаНДС;  //nva
	
	ОбщиеДанныеНоменклатуры = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ОбщиеДанныеНоменклатуры, СтруктураДанные);
	ОбщиеДанныеНоменклатуры = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(ОбщиеДанныеНоменклатуры);
	
	СтруктураДанные.Вставить("СтатьяДоходов",  ОбщиеДанныеНоменклатуры.СтатьяДоходов);
	СтруктураДанные.Вставить("СтатьяРасходов", ОбщиеДанныеНоменклатуры.СтатьяРасходов);
	
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда  //nva
		СтруктураДанные.СтавкаНДС = СтавкаНДС;//nva
	КонецЕсли;	//nva
	//Цена = ПолучитьЦенуНоменклатуры(СтруктураДанные);	
	//СтруктураДанные.Вставить("Цена", Цена);
	
	Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтруктураДанные.Вставить("Коэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("Коэффициент", ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтруктураДанные.ЕдиницаИзмерения));
	КонецЕсли;
		
	Если СтруктураДанные.ИспользоватьКонтрольКратности 
		И НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешитьНесоответствиеКратностиЕдиницИзмерения") Тогда
		
		СтруктураПоиска = Новый Структура("ВидДокумента, ЕдиницаИзмерения", Перечисления.ВидыДокументовПроверкиКратности.РеализацияТоваровИУслуг, СтруктураДанные.ЕдиницаИзмерения);
		НайденныеСтроки = СтруктураДанные.Номенклатура.Кратность.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда		
			СтруктураДанные.Вставить("Количество", 0); //#2792
		Иначе
			СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
		КонецЕсли;
	Иначе
		СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции


&НаСервере
Процедура ЗаполнитьПоПродажамНаСервере()
	Объект.Товары.Очистить();
	ПараметрыЗаполнения = Новый Структура("ТабличнаяЧасть, Поставщик", Объект.Товары, Объект.Контрагент);
	ОбработкаТабличныхЧастейСервер.ЗаполнитьТабличнуюЧастьПоПродажамНоменклатурыПоПоставщикуСервер(ПараметрыЗаполнения);
	
	Для каждого СтрокаТабличнойЧасти из Объект.Товары Цикл
		СтрокаТабличнойЧасти.Цена = ПолучитьЦенуПоставщика(СтрокаТабличнойЧасти.Номенклатура, СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры, СтрокаТабличнойЧасти.ЕдиницаИзмерения);
		//СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Количество;
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуСУчетомСкидокВСтрокеТЧ(СтрокаТабличнойЧасти, Ложь, Ложь, Ложь);
		ОбработкаТабличныхЧастейСервер.ПересчитатьСуммуНДСВСтрокеТЧ(СтрокаТабличнойЧасти, УчитыватьНДС);
	КонецЦикла;
	ЗаполнитьЦеныПредыдущегоПоступления();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоПродажам(Команда) 
	ЗаполнитьПоПродажамНаСервере();
КонецПроцедуры


&НаСервере
Процедура СкладПриИзмененииНаСервере()
	ПерезаполнитьЯчейки();
	ЗаполнитьМинМаксОстаток();
КонецПроцедуры

Процедура ПерезаполнитьЯчейки()
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЧ.Ячейка = ОбщийМодульДокументы.ПолучитьЯчейку(СтрокаТЧ.Номенклатура, Объект.Склад);
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	СкладПриИзмененииНаСервере();
КонецПроцедуры
//nva---
