
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ДополнительныйКлючОтчета", "ЭффективностьРекламныхАкций");
	//ПараметрыФормы.Вставить("ОтчетНаименование", "Эффективность рекламных акций");
	
	ОткрытьФорму("Отчет.ЭффективностьРекламныхАкций.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
